Repository: bobdodd/auto_a11y_python
Catalog: auto_a11y/web/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: No roles assigned
fr: Notes informatives

source: Description:
fr: Aucune description

source: Authentication Method:
fr: Méthode d'authentification

source: Login URL:
fr: URL de connexion :

source: Username Field:
fr: Audité

source: Password Field:
fr: Audité

source: Submit Button:
fr: Tout sélectionner

source: Success Indicator:
fr: Indicateur de succès :

source: Session Timeout:
fr: Code temporel

source: Logout URL:
fr: URL de déconnexion

source: Logout Button:
fr: Tout sélectionner

source: Logout Success Indicator:
fr: Indicateur de succès :

source: Are you sure you want to delete this user? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le projet

source: Delete User
fr: Scripts de configuration

source: Created:
fr: Créé :

source: Last Modified:
fr: Dernier test

source: Back to Test Users
fr: Ajouter des utilisateurs de test

source: Create Project
fr: Supprimer le projet

source: Create New Project
fr: Nouveau projet

source: Debug Mode Active:
fr: Mode débogage actif :

source: All tests are available regardless of fixture status.
fr: Tous les tests sont disponibles indépendamment de l'état des fixtures.

source: View Fixture Status
fr: État des fixtures

source: Test Availability:
fr: Disponibilité des tests :

source: Only tests that passed fixture validation are enabled.
fr: Seuls les tests ayant réussi la validation des fixtures sont activés.

source: Project Name
fr: Projets

source: Choose a unique name for your project
fr: Choisissez un nom unique pour votre projet

source: Optional description of the project goals
fr: Description optionnelle des objectifs du projet

source: Project Type
fr: Projets

source: Website
fr: Site web

source: App
fr: Application

source: Tangible Device
fr: Appareil tangible

source: Nav and Wayfinding
fr: Navigation et orientation

source: Select the type of project you're testing
fr: Sélectionnez le type de projet que vous testez

source: App Identifier
fr: Identifiant de l'application

source: e.g., com.example.myapp or Bundle ID
fr: par ex., com.exemple.monapp ou Bundle ID

source: Optional: Package name (Android) or Bundle ID (iOS)
fr: Optionnel : Nom du paquet (Android) ou Bundle ID (iOS)

source: Device Model
fr: Modèle d'appareil

source: e.g., NCR SelfServ 84, Diebold ATM
fr: par ex., NCR SelfServ 84, Diebold ATM

source: Optional: Manufacturer and model of the device
fr: Optionnel : Fabricant et modèle de l'appareil

source: Location
fr: Actions

source: e.g., Building A, Floor 2 or Downtown Campus
fr: par ex., Bâtiment A, Étage 2 ou Campus Centre-ville

source: Optional: Physical location of the navigation system
fr: Optionnel : Emplacement physique du système de navigation

source: Drupal Audit (Optional)
fr: Nom (Optionnel)

source: Auto-match by project name
fr: Correspondance automatique par nom de projet

source: Loading audits...
fr: Chargement des audits...

source: Select the corresponding audit in Drupal for synchronization. Leave as "Auto-match" to use the project name.
fr: Sélectionnez l'audit correspondant dans Drupal pour la synchronisation. Laissez "Correspondance automatique" pour utiliser le nom du projet.Sélectionnez l'audit correspondant dans Drupal pour la synchronisation. Laissez "Correspondance automatique" pour utiliser le nom du projet.

source: WCAG Compliance Level
fr: Conformité WCAG

source: Level AA (Recommended)
fr: Niveau AA (Recommandé)

source: Level AAA (Enhanced)
fr: Niveau AAA (Amélioré)

source: Standard compliance (4.5:1 contrast for normal text, 3:1 for large text)
fr: Conformité standard (contraste 4.5:1 pour le texte normal, 3:1 pour le texte large)Conformité standard (contraste 4.5:1 pour le texte normal, 3:1 pour le texte large)Conformité standard (contraste 4.5:1 pour le texte normal, 3:1 pour le texte large)Conformité standard (contraste 4.5:1 pour le texte normal, 3:1 pour le texte large)Conformité standard (contraste 4.5:1 pour le texte normal, 3:1 pour le texte large)Conformité standard (contraste 4.5:1 pour le texte normal, 3:1 pour le texte large)

source: Enhanced compliance (7:1 contrast for normal text, 4.5:1 for large text)
fr: Conformité renforcée (contraste 7:1 pour le texte normal, 4.5:1 pour le texte large)Conformité renforcée (contraste 7:1 pour le texte normal, 4.5:1 pour le texte large)Conformité renforcée (contraste 7:1 pour le texte normal, 4.5:1 pour le texte large)Conformité renforcée (contraste 7:1 pour le texte normal, 4.5:1 pour le texte large)Conformité renforcée (contraste 7:1 pour le texte normal, 4.5:1 pour le texte large)Conformité améliorée (contraste 7:1 pour le texte normal, 4.5:1 pour le texte large)

source: Page Load Strategy
fr: Stratégie de chargement de page

source: Network Idle 2 (Default - Best for most sites)
fr: Network Idle 2 (Par défaut - Optimal pour la plupart des sites)

source: Network Idle 0 (Very thorough, slowest)
fr: Network Idle 0 (Très complet, le plus lent)

source: DOM Content Loaded (Fast, for sites with heavy background activity)
fr: Contenu DOM chargé (rapide, pour les sites avec beaucoup d'activité en arrière-plan)Contenu DOM chargé (rapide, pour les sites avec beaucoup d'activité en arrière-plan)Contenu DOM chargé (rapide, pour les sites avec beaucoup d'activité en arrière-plan)DOM Content Loaded (Rapide, pour les sites avec beaucoup d'activité en arrière-plan)

source: Load Event (Middle ground)
fr: Load Event (Compromis)

source: Controls when testing begins after navigating to a page:
fr: Contrôle quand les tests commencent après la navigation vers une page :

source: Wait until network has ≤2 connections (best for dynamic sites)
fr: Attendre jusqu'à ce que le réseau ait ≤2 connexions (idéal pour les sites dynamiques)Attendre jusqu'à ce que le réseau ait ≤2 connexions (idéal pour les sites dynamiques)Attendre jusqu'à ce que le réseau ait ≤2 connexions (idéal pour les sites dynamiques)Attendre jusqu'à ce que le réseau ait ≤2 connexions (idéal pour les sites dynamiques)Attendre jusqu'à ce que le réseau ait ≤2 connexions (idéal pour les sites dynamiques)Attendre que le réseau ait ≤2 connexions (optimal pour les sites dynamiques)

source: Wait until network is completely idle (very thorough but slow)
fr: Attendre que le réseau soit complètement inactif (très complet mais lent)

source: Test as soon as DOM is ready (use for BBC News, sites with continuous ads/analytics)
fr: Tester dès que le DOM est prêt (à utiliser pour BBC News, sites avec publicités/analytics en continu)Tester dès que le DOM est prêt (à utiliser pour BBC News, sites avec publicités/analytics en continu)

source: Wait for load event (faster than network idle)
fr: Attendre l'événement de chargement (plus rapide que network idle)

source: Browser Display Mode
fr: Mode d'affichage du navigateur

source: Headless (No visible browser)
fr: Sans interface (Navigateur invisible)

source: Visible Browser (Show Chrome window)
fr: Navigateur visible (Afficher la fenêtre Chrome)

source: Headless
fr: Sans interface

source: Run browser invisibly (faster, less resource intensive)
fr: Exécuter le navigateur de manière invisible (plus rapide, moins de ressources)Exécuter le navigateur de manière invisible (plus rapide, moins de ressources)Exécuter le navigateur de manière invisible (plus rapide, moins de ressources)Exécuter le navigateur de manière invisible (plus rapide, moins de ressources)Exécuter le navigateur de manière invisible (plus rapide, moins de ressources)Exécuter le navigateur de manière invisible (plus rapide, moins gourmand en ressources)

source: Visible Browser
fr: Navigateur visible

source: Show the Chrome window (useful for debugging)
fr: Afficher la fenêtre Chrome (utile pour le débogage)

source: Enable Stealth Mode (for Cloudflare-protected sites)
fr: Activer le mode furtif (pour les sites protégés par Cloudflare)

source: Enables advanced bot detection bypass techniques. Use for sites protected by Cloudflare or similar services.
fr: Active les techniques avancées de contournement de détection de bot. À utiliser pour les sites protégés par Cloudflare ou des services similaires.Active les techniques avancées de contournement de détection de bot. À utiliser pour les sites protégés par Cloudflare ou des services similaires.

source: Stealth mode significantly slows down page discovery and testing (~5-15 seconds per page).
fr: Le mode furtif ralentit considérablement la découverte et les tests de pages (~5-15 secondes par page).Le mode furtif ralentit considérablement la découverte et les tests de pages (~5-15 secondes par page).

source: Touchpoint Tests Configuration
fr: Configuration

source: Configure which accessibility tests to run. Tests are organized by touchpoint (testing category).
fr: Configurez les tests d'accessibilité à exécuter. Les tests sont organisés par point de contact (catégorie de test).Configurez les tests d'accessibilité à exécuter. Les tests sont organisés par point de contact (catégorie de test).

source: Enable All
fr: Tout activer

source: Disable All
fr: Tout désactiver

source: AI-Assisted Testing
fr: Tests assistés par IA

source: Enable AI-assisted accessibility testing
fr: Plateforme de tests d'accessibilité automatisés

source: AI testing uses Claude to analyze screenshots and HTML for issues that automated tests might miss.
fr: Les tests IA utilisent Claude pour analyser les captures d'écran et le HTML afin de détecter les problèmes que les tests automatisés pourraient manquer.Les tests IA utilisent Claude pour analyser les captures d'écran et le HTML afin de détecter les problèmes que les tests automatisés pourraient manquer.

source: AI testing incurs API costs based on usage.
fr: Les tests IA entraînent des coûts d'API en fonction de l'utilisation.

source: Select AI Tests to Run:
fr: Sélectionner les tests IA à exécuter :

source: Heading Analysis
fr: Analyse par IA

source: Detects visual headings not properly marked up
fr: Détecte les titres visuels non correctement balisés

source: Reading Order
fr: Ordre de lecture

source: Verifies logical reading sequence matches visual layout
fr: Vérifie que la séquence de lecture logique correspond à la disposition visuelleVérifie que la séquence de lecture logique correspond à la disposition visuelleVérifie que la séquence de lecture logique correspond à la disposition visuelleVérifie que la séquence de lecture logique correspond à la mise en page visuelle

source: Modal Dialogs
fr: Boîtes de dialogue modales

source: Analyzes popup and overlay accessibility
fr: Analyse l'accessibilité des popups et overlays

source: Language Detection
fr: Détection de langue

source: Identifies mixed languages and missing declarations
fr: Identifie les langues mixtes et les déclarations manquantes

source: Animations
fr: Actions

source: Detects potentially problematic motion
fr: Détecte les mouvements potentiellement problématiques

source: Interactive Elements
fr: Éléments de la page

source: Analyzes buttons, links, and form controls
fr: Analyse les boutons, liens et contrôles de formulaire

source: Select All
fr: Tout sélectionner

source: Deselect All
fr: Tout désélectionner

source: Test Details
fr: Détails du test

source: Loading test details...
fr: Chargement des détails du test...

source: Production Ready
fr: Prêt pour la production

source: Pending Review
fr: En attente

source: Documentation Status:
fr: Documents

source: This test has production-ready documentation.
fr: Ce test a une documentation prête pour la production.

source: This test documentation is pending review and may be incomplete.
fr: Cette documentation de test est en attente de révision et peut être incomplète.

source: Mark as
fr: pages

source: Pending
fr: En attente

source: What This Test Detects
fr: Qui cela affecte :

source: Why It Matters
fr: Qui cela affecte :

source: Who It Affects
fr: Qui cela affecte :

source: How to Fix
fr: Comment corriger :

source: Violation Message Templates
fr: Modèles de messages de violation

source: Title Template:
fr: Page sans titre

source: What (Description) Template:
fr: Aucune description

source: Why (Rationale) Template:
fr: Modèle Pourquoi (Justification) :

source: Remediation Template:
fr: Modèle de remédiation :

source: Test Information Not Available
fr: Informations sur le test non disponibles

source: Details for test
fr: Détails pour le test

source: are not available in the catalog.
fr: ne sont pas disponibles dans le catalogue.

source: Error Loading Test Details
fr: Chargement des détails du test...

source: An error occurred while loading the test details. Please try again.
fr: Une erreur s'est produite lors du chargement des détails du test. Veuillez réessayer.Une erreur s'est produite lors du chargement des détails du test. Veuillez réessayer.Une erreur s'est produite lors du chargement des détails du test. Veuillez réessayer.Une erreur s'est produite lors du chargement des détails du test. Veuillez réessayer.Une erreur s'est produite lors du chargement des détails du test. Veuillez réessayer.

source: Updating...
fr: Démarrage...

source: Refreshing...
fr: Actualisation...

source: Error:
fr: Erreurs :

source: No Drupal audits found
fr: Nom (Optionnel)

source: Could not load audits (Drupal may not be configured)
fr: Impossible de charger les audits (Drupal n'est peut-être pas configuré)

source: Edit Project
fr: Modifier le projet

source: Paused
fr: Audité

source: Completed
fr: Vient de se terminer

source: Archived
fr: Archivé

source: Page Title Length Limit
fr: Limite de longueur du titre de page

source: Maximum recommended characters for page titles. Default is 60. Titles longer than this will generate a warning.
fr: Nombre maximum recommandé de caractères pour les titres de page. La valeur par défaut est 60. Les titres plus longs que cela généreront un avertissement.

source: Browser tabs typically show ~30 characters, search results show ~50-60 characters.
fr: Les onglets du navigateur affichent généralement environ 30 caractères, les résultats de recherche affichent environ 50-60 caractères.

source: Heading Length Limit
fr: Analyse par IA

source: Maximum recommended characters for headings (h1-h6). Default is 60. Headings longer than this will generate a warning.
fr: Nombre maximum recommandé de caractères pour les en-têtes (h1-h6). La valeur par défaut est 60. Les en-têtes plus longs que cela généreront un avertissement.

source: Headings approaching this limit (above 67%% of the limit) will generate an info message.
fr: Les titres approchant cette limite (au-dessus de 67%% de la limite) génèreront un message d'information.

source: Inaccessible Fonts Configuration
fr: Configuration

source: Configure which fonts should be flagged as inaccessible for this project.
fr: Configurez les polices à signaler comme inaccessibles pour ce projet.

source: Use system default inaccessible fonts list
fr: Utiliser la liste système des polices inaccessibles par défaut

source: Additional Fonts to Flag
fr: Polices supplémentaires à signaler

source: Enter font names, one per line (e.g., 'Custom Font Name')
fr: Entrez les noms de police, un par ligne (par ex., 'Nom de police personnalisée')Entrez les noms de police, un par ligne (par ex., 'Nom de police personnalisée')Entrez les noms de police, un par ligne (par ex., 'Nom de police personnalisée')Entrez les noms de police, un par ligne (par ex., 'Nom de police personnalisée')

source: Add project-specific fonts that should be flagged as inaccessible. One font name per line, lowercase.
fr: Ajoutez des polices spécifiques au projet qui doivent être signalées comme inaccessibles. Un nom de police par ligne, en minuscules.

source: Fonts to Exclude from Checking
fr: Polices à exclure de la vérification

source: Enter font names, one per line (e.g., 'comic sans ms')
fr: Entrez les noms de police, un par ligne (par ex., 'comic sans ms')

source: Remove specific fonts from the default list if your project requires them. One font name per line, lowercase.
fr: Supprimez des polices spécifiques de la liste par défaut si votre projet les nécessite. Un nom de police par ligne, en minuscules.

source: View System Default Inaccessible Fonts List
fr: Voir la liste système des polices inaccessibles par défaut

source: Script/Cursive Fonts (17 fonts)
fr: Polices script/cursives (17 polices)

source: Show all 17 fonts...
fr: Afficher les 17 polices...

source: Decorative Fonts (16 fonts)
fr: Polices décoratives (16 polices)

source: Show all 16 fonts...
fr: Afficher les 16 polices...

source: Narrow/Condensed Fonts (2 fonts)
fr: Polices étroites/condensées (2 polices)

source: Blackletter/Gothic Fonts (5 fonts)
fr: Polices gothiques/Blackletter (5 polices)

source: 40 fonts across 4 categories
fr: 40 polices dans 4 catégories

source: Update Project
fr: Supprimer le projet

source: All
fr: Tous

source: No description
fr: Aucune description

source: Updated:
fr: Date

source: No projects found.
fr: Nouveau projet

source: Create your first project
fr: Créez votre premier projet

source: Test All Websites
fr: Tester tous les sites

source: Automated Tests
fr: Tests automatisés

source: Websites
fr: Sites web

source: coverage
fr: couverture

source: Issues
fr: Problèmes

source: warnings
fr: avertissements

source: Add Website
fr: Ajouter un site web

source: Never tested
fr: Testées

source: Discover
fr: Découvrir

source: No websites added yet. Add a website to start testing.
fr: Aucun site web ajouté pour le moment. Ajoutez un site web pour commencer les tests.Aucun site web ajouté pour le moment. Ajoutez un site web pour commencer les tests.Aucun site web ajouté pour le moment. Ajoutez un site web pour commencer les tests.Aucun site web ajouté pour le moment. Ajoutez un site web pour commencer les tests.Aucun site web ajouté pour le moment. Ajoutez un site web pour commencer les tests.Aucun site web ajouté pour le moment. Ajoutez un site web pour commencer les tests.

source: Title
fr: Titre

source: Interested Because
fr: Intéressant parce que

source: Page Elements
fr: Éléments de la page

source: Sync Status
fr: État de la synchronisation

source: reasons
fr: raisons

source: elements
fr: éléments

source: Audited
fr: Audité

source: Not Audited
fr: Non audité

source: Manual
fr: Manuel

source: Not Synced
fr: Non synchronisé

source: Untitled
fr: Titre

source: No discovered pages yet. Pull pages from Drupal using the synchronization page below.
fr: Aucune page découverte pour le moment. Extrayez les pages de Drupal en utilisant la page de synchronisation ci-dessous.

source: Add Recording
fr: Ajouter un enregistrement

source: Add
fr: Audité

source: Auditor/Tester
fr: Auditeur/Testeur

source: All Recordings Combined
fr: Tous les enregistrements combinés

source: recordings
fr: enregistrements

source: View Combined
fr: Voir combiné

source: View All Combined
fr: Voir combiné

source: No recordings added yet.
fr: Aucun enregistrement ajouté pour le moment.

source: Upload a recording
fr: Télécharger un enregistrement

source: to track manual accessibility audits.
fr: pour suivre les audits d'accessibilité manuels.

source: Website URL
fr: URL du site web

source: Name (Optional)
fr: Nom (Optionnel)

source: Main Website
fr: Site web principal

source: Discovery Options
fr: Options de découverte

source: Select users for discovery:
fr: Sélectionner les utilisateurs pour la découverte :

source: no login
fr: sans connexion

source: Discovery will run with the selected user(s).
fr: La découverte s'exécutera avec le(s) utilisateur(s) sélectionné(s).

source: Manage test users
fr: Gérer les utilisateurs de test

source: Add test users
fr: Ajouter des utilisateurs de test

source: to discover pages requiring authentication.
fr: pour découvrir les pages nécessitant une authentification.

source: Maximum Pages to Discover
fr: Nombre maximum de pages à découvrir

source: Leave empty for no limit
fr: Laisser vide pour aucune limite

source: Limit the number of pages to discover (useful for large sites)
fr: Limiter le nombre de pages à découvrir (utile pour les grands sites)

source: Discovery will crawl the website starting from the home page, following links to find all accessible pages.
fr: La découverte explorera le site web à partir de la page d'accueil, en suivant les liens pour trouver toutes les pages accessibles.

source: Start Discovery
fr: Commencer la découverte

source: Test All Websites in Project
fr: Tester tous les sites web du projet

source: This will test all websites in the project
fr: Cela testera tous les sites web du projet

source: website(s)
fr: site(s) web

source: will be tested across multiple base URLs.
fr: seront testés sur plusieurs URL de base.

source: Test all pages (unchecked = only untested pages)
fr: Tester toutes les pages (décoché = seulement les pages non testées)

source: Take screenshots of issues
fr: Prendre des captures d'écran des problèmes

source: Run AI analysis (requires OpenAI API key)
fr: Exécuter l'analyse IA (nécessite une clé API OpenAI)

source: Start Testing All Websites
fr: Commencer à tester tous les sites web

source: Delete Project
fr: Supprimer le projet

source: Are you sure you want to delete the project
fr: Êtes-vous sûr de vouloir supprimer le projet

source: This will permanently delete all websites, pages, and test results associated with this project.
fr: Cela supprimera définitivement tous les sites web, pages et résultats de tests associés à ce projet.

source: Just completed
fr: Vient de se terminer

source: Discovery is already running for this website. Do you want to cancel it?
fr: La découverte est déjà en cours pour ce site web. Voulez-vous l'annuler ?

source: Please select at least one user for discovery (or Guest).
fr: Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).

source: Starting...
fr: Démarrage...

source: Discovering pages for
fr: Découverte des pages pour

source: Discovery Started
fr: Découverte démarrée

source: Failed to start discovery
fr: Échec du démarrage de la découverte

source: Failed to start page discovery
fr: Échec de la suppression du rapport

source: No discovery job to cancel
fr: Aucune tâche de découverte à annuler

source: Discovery Cancelled
fr: Découverte annulée

source: Failed to cancel discovery:
fr: Échec de l'annulation de la découverte :

source: Failed to cancel discovery
fr: Échec de l'annulation de la découverte

source: Cancel the discovery process?
fr: Annuler le processus de découverte ?

source: Found
fr: Trouvé

source: Discovery Complete
fr: Découverte terminée

source: Discovery failed:
fr: Échec de la découverte :

source: Save
fr: Actions

source: Are you sure you want to delete this recording?
fr: Êtes-vous sûr de vouloir supprimer le projet

source: Recording ID
fr: enregistrements

source: Tester
fr: Testées

source: Test Supervisor
fr: Superviseur de test

source: Test User Account
fr: Utilisateurs de test

source: Recording Date
fr: enregistrements

source: Recording Type
fr: Type d'enregistrement

source: Available Languages
fr: Télécharger un enregistrement

source: Project
fr: Projet

source: Pages Covered
fr: Découvrir

source: No pages specified
fr: Aucune page spécifiée

source: Enter one URL per line
fr: Entrez une URL par ligne

source: No discovered pages selected
fr: Pages découvertes

source: Loading discovered pages...
fr: Chargement des pages découvertes...

source: Select discovered pages related to this recording
fr: Sélectionner les pages découvertes liées à cet enregistrement

source: Common Components
fr: Composants communs
