Repository: bobdodd/auto_a11y_python
Catalog: auto_a11y/web/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Usually checked - test the page in its final state after setup
fr: Généralement coché - tester la page dans son état final après la configurationGénéralement coché - tester la page dans son état final après la configurationGénéralement coché - tester la page dans son état final après la configuration

source: Script Scope
fr: Aucune description

source: Script Applies To:
fr: Le script s'applique à :

source: Website-Level:
fr: Sites web

source: This script will run for all pages in the website
fr: Ce script s'exécutera pour toutes les pages du site web

source: Page-Level:
fr: Niveau AA :

source: This script only runs on this specific page
fr: Ce script s'exécute uniquement sur cette page spécifique

source: Execution Trigger
fr: Déclencheur d'exécution

source: When should this script run?
fr: Quand ce script doit-il s'exécuter ?

source: Select when this script should execute during testing
fr: Sélectionner quand ce script doit s'exécuter pendant les tests

source: Conditional Selector
fr: Sélecteur conditionnel

source: Script will only run if this element exists on the page
fr: Le script ne s'exécutera que si cet élément existe sur la page

source: Wait for element to appear
fr: Attendre l'apparition de l'élément

source: Wait Timeout (ms)
fr: Délai d'attente (ms)

source: Maximum time to wait for element (milliseconds)
fr: Temps maximum d'attente de l'élément (millisecondes)

source: Clean State Options
fr: Options d'état propre

source: Clear cookies and storage before testing to ensure a clean starting state
fr: Effacer les cookies et le stockage avant les tests pour garantir un état de départ propreEffacer les cookies et le stockage avant les tests pour garantir un état de départ propreEffacer les cookies et le stockage avant les tests pour garantir un état de départ propre

source: Clear Cookies Before Script
fr: Effacer les cookies avant le script

source: Recommended for cookie banner testing - ensures banner appears
fr: Recommandé pour les tests de bannière de cookies - garantit l'apparition de la bannièreRecommandé pour les tests de bannière de cookies - garantit l'apparition de la bannièreRecommandé pour les tests de bannière de cookies - garantit l'apparition de la bannière

source: Clear Local Storage Before Script
fr: Effacer le stockage local avant le script

source: Clear localStorage and sessionStorage before running
fr: Effacer localStorage et sessionStorage avant l'exécution

source: State Validation (Optional)
fr: Nom (Optionnel)

source: Elements That Should Be <strong>Visible</strong> After Script
fr: Éléments qui doivent être <strong>visibles</strong> après le script

source: Elements That Should Be <strong>Hidden</strong> After Script
fr: Éléments qui doivent être <strong>cachés</strong> après le script

source: Script Steps
fr: Aucune description

source: Define the actions to perform. Steps execute in order from top to bottom.
fr: Définir les actions à effectuer. Les étapes s'exécutent dans l'ordre de haut en bas.Définir les actions à effectuer. Les étapes s'exécutent dans l'ordre de haut en bas.Définir les actions à effectuer. Les étapes s'exécutent dans l'ordre de haut en bas.

source: Add Step
fr: Ajouter un site web

source: Create Script
fr: Scripts de configuration

source: Quick Help
fr: Aide rapide

source: Common Selectors
fr: Tout sélectionner

source: Class name
fr: Taux de réussite

source: Attribute
fr: Attribut

source: Nested
fr: Testées

source: Step Types
fr: Type

source: Click:
fr: Cliquer :

source: Click a button/link
fr: Cliquer sur un bouton/lien

source: Enter text in field
fr: Tests

source: Wait for Element:
fr: Éléments de la page

source: Wait until element appears
fr: Attendre l'apparition de l'élément

source: Wait (Fixed):
fr: Attente (fixe) :

source: Pause for X milliseconds
fr: Pause de X millisecondes

source: Examples
fr: Exemple :

source: Cookie Banner:
fr: Bannière de cookies :

source: Wait for:
fr: Audité

source: Modal:
fr: Total :

source: Step
fr: Testées

source: Remove
fr: Résolu

source: Action Type
fr: Actions

source: -- Select Action --
fr: -- Sélectionner une action --

source: Selector (CSS or XPath)
fr: Sélecteur (CSS ou XPath)

source: CSS selector or XPath (XPath must start with / or //)
fr: Sélecteur CSS ou XPath (XPath doit commencer par / ou //)

source: Value
fr: Valeur

source: Text to type or value to set
fr: Texte à saisir ou valeur à définir

source: Description (Optional)
fr: Nom (Optionnel)

source: e.g., Wait for cookie banner to appear
fr: par ex., Attendre l'apparition de la bannière de cookies

source: Timeout (ms)
fr: code(s) temporel(s)

source: Wait After (ms)
fr: Attente après (ms)

source: Please add at least one step to the script.
fr: Veuillez ajouter au moins une étape au script.Veuillez ajouter au moins une étape au script.Veuillez ajouter au moins une étape au script.Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).

source: Edit Script: %(name)s - Auto A11y
fr: Modifier le script : %(name)s - Auto A11y

source: Update Script
fr: Tester le site web

source: Edit Page Setup Script
fr: Scripts de configuration

source: Setup Scripts
fr: Scripts de configuration

source: Page Setup Scripts
fr: Scripts de configuration

source: Website Setup Scripts
fr: Scripts de configuration

source: Multi-State Testing:
fr: Tests

source: Page-Specific Scripts
fr: Scripts spécifiques à la page

source: Steps
fr: Tester

source: Multi-State
fr: Multi-état

source: Trigger
fr: Déclencheur

source: %(count)s steps
fr: %(count)s étapes

source: Tests both before and after script
fr: Teste avant et après le script

source: Before & After
fr: Avant et après

source: Tests before script only
fr: Teste avant le script uniquement

source: Before Only
fr: Avant uniquement

source: Tests after script only
fr: Teste après le script uniquement

source: After Only
fr: Après uniquement

source: No Testing
fr: Tests

source: No page-specific scripts yet
fr: Aucune page spécifiée

source: Create Your First Script
fr: Créez votre premier projet

source: Website-Wide Scripts
fr: Scripts de configuration

source: Both
fr: Les deux

source: Toggle this script (enable/disable)?
fr: Basculer ce script (activer/désactiver) ?

source: Error toggling script:
fr: Chargement des détails du test...

source: Are you sure you want to delete this script? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le projet

source: Error deleting script:
fr: Chargement des détails du test...

source: Edit Script
fr: Scripts de configuration

source: Script Configuration
fr: Configuration

source: Website-Wide
fr: Sites web

source: Test Before Execution
fr: Configuration

source: Test After Execution
fr: Configuration

source: No testing configured
fr: Tests

source: Selector
fr: Tout sélectionner

source: Timeout
fr: Code temporel

source: Wait
fr: WCAG AA

source: No steps configured
fr: Configuration

source: State Validation
fr: Actions

source: Expected Visible Elements:
fr: Éléments visibles attendus :

source: Expected Hidden Elements:
fr: Éléments cachés attendus :

source: Script
fr: Aucune description

source: Delete Script
fr: Scripts de configuration

source: Metadata
fr: Métadonnées

source: Script ID:
fr: Aucune description

source: Testing Configuration
fr: Configuration des tests

source: Parallel Tests
fr: Tests parallèles

source: Number of tests to run in parallel
fr: Nombre de tests à exécuter en parallèle

source: Test Timeout (seconds)
fr: Délai d'expiration du test (secondes)

source: Maximum time per page test
fr: Temps maximum par test de page

source: Enable AI Analysis
fr: Activer l'analyse IA

source: Use Claude AI for visual accessibility analysis
fr: Utiliser Claude IA pour l'analyse visuelle de l'accessibilité

source: Headless Browser
fr: Navigateur sans interface

source: Run browser in headless mode
fr: Exécuter le navigateur en mode sans interface

source: Viewport Width
fr: Largeur de la fenêtre

source: Viewport Height
fr: Hauteur de la fenêtre

source: UI Pagination Settings
fr: Paramètres de pagination de l'interface

source: Pages Per Page
fr: Pages par page

source: Default number of pages shown per view
fr: Nombre par défaut de pages affichées par vue

source: Maximum Pages Per Page
fr: Maximum de pages par page

source: Maximum allowed per page (for ?per_page parameter)
fr: Maximum autorisé par page (pour le paramètre ?per_page)

source: Developer Options
fr: Options de découverte

source: Show Error Codes
fr: %s : erreur : %s

source: System Maintenance
fr: Maintenance du système

source: Warning:
fr: Avertissement :

source: These actions cannot be undone.
fr: Ces actions ne peuvent pas être annulées.

source: Clear Outstanding Jobs
fr: Effacer les travaux en suspens

source: Reset all running and pending scrapes and tests. Use this if the system appears stuck.
fr: Réinitialiser toutes les extractions et tests en cours et en attente. Utilisez ceci si le système semble bloqué.

source: Clear All Jobs
fr: Effacer tous les travaux

source: Clear Stale Jobs
fr: Effacer les travaux périmés

source: Remove jobs that have been running for more than 24 hours.
fr: Supprimer les travaux en cours depuis plus de 24 heures.

source: Clean Page Data
fr: Nettoyer les données de page

source: Reset violation counts for pages that haven't been tested yet. Fixes data inconsistencies.
fr: Réinitialiser les décomptes de violations pour les pages qui n'ont pas encore été testées. Corrige les incohérences de données.

source: Loading job statistics...
fr: Chargement des statistiques des travaux...

source: Confirm Action
fr: Confirmer l'action

source: Confirm
fr: Configurer

source: Running:
fr: En cours :

source: jobs
fr: travaux

source: Pending:
fr: En attente :

source: Cancelling:
fr: Annulation :

source: Completed (24h):
fr: Terminés (24h) :

source: Failed (24h):
fr: Échoués (24h) :

source: Failed to load statistics
fr: Échec du chargement des statistiques

source: This will clear ALL running and pending jobs. This action cannot be undone. Are you sure?
fr: Ceci effacera TOUS les travaux en cours et en attente. Cette action ne peut pas être annulée. Êtes-vous sûr ?

source: Successfully cleared
fr: Effacé avec succès

source: Failed to clear jobs
fr: Échec de l'effacement des travaux

source: An error occurred while clearing jobs
fr: Une erreur s'est produite lors de l'effacement des travaux

source: This will clear all jobs that have been running for more than 24 hours. Are you sure?
fr: Ceci effacera tous les travaux en cours depuis plus de 24 heures. Êtes-vous sûr ?

source: stale jobs
fr: travaux périmés

source: Failed to clear stale jobs
fr: Échec de l'effacement des travaux périmés

source: An error occurred while clearing stale jobs
fr: Une erreur s'est produite lors de l'effacement des travaux périmés

source: Configuration saved successfully
fr: Configuration enregistrée avec succès

source: Failed to save configuration
fr: Échec de l'enregistrement de la configuration

source: An error occurred while saving configuration
fr: Une erreur s'est produite lors de l'enregistrement de la configuration

source: This will reset violation counts for all pages that haven't been tested yet. Continue?
fr: Ceci réinitialisera les décomptes de violations pour toutes les pages qui n'ont pas encore été testées. Continuer ?

source: Successfully cleaned
fr: Nettoyé avec succès

source: Failed to clean page data
fr: Échec du nettoyage des données de page

source: An error occurred while cleaning page data
fr: Une erreur s'est produite lors du nettoyage des données de page

source: Testing Dashboard - Auto A11y
fr: Tableau de bord des tests - Auto A11y

source: Testing Dashboard
fr: Tableau de bord des tests

source: Active Tests
fr: Tests actifs

source: Queued Tests
fr: Tests en file d'attente

source: Completed Today
fr: Terminés aujourd'hui

source: Failed Tests
fr: Tests échoués

source: Quick Test
fr: Test rapide

source: URL to test
fr: URL à tester

source: Enter URL to test (e.g., https://example.com)
fr: Entrer l'URL à tester (p. ex., https://example.com)

source: Recent Test Results
fr: Résultats de tests récents

source: Configure
fr: Configurer

source: Test Date
fr: Date du test

source: View page details
fr: Voir les détails de la page

source: Complete
fr: Terminé

source: No recent test results
fr: Aucun résultat de test récent

source: Please enter a URL to test
fr: Veuillez entrer une URL à tester

source: Quick test functionality will be implemented
fr: La fonctionnalité de test rapide sera implémentée

source: Test Result
fr: Tester le site web

source: Unknown Page
fr: Erreur inconnue

source: Back to Page
fr: Retour à la page

source: Violations
fr: Actions

source: Learn More:
fr: En savoir plus :

source: Selector:
fr: Tout sélectionner

source: Details
fr: Détails du test

source: Pseudoclass:
fr: Pseudo-classe :

source: No violations found! The page passes all automated accessibility checks.
fr: Aucune violation trouvée ! La page réussit tous les tests d'accessibilité automatisés.Aucune violation trouvée ! La page réussit tous les tests d'accessibilité automatisés.Aucune violation trouvée ! La page réussit tous les tests d'accessibilité automatisés.Aucune violation trouvée ! La page réussit tous les tests d'accessibilité automatisés.

source: Test Information
fr: Configuration

source: Test ID:
fr: Testées

source: Test Date:
fr: Tester le site web

source: seconds
fr: secondes

source: Test Suite:
fr: Tester le site web

source: Test Configuration
fr: Configuration

source: AI Analysis:
fr: Analyse par IA

source: Rules Run:
fr: Règles exécutées :

source: Viewport:
fr: Voir les projets

source: Additional Metadata
fr: Métadonnées supplémentaires

source: - User is active and can be used for testing
fr: - L'utilisateur est actif et peut être utilisé pour les tests

source: Authenticated Testing:
fr: Tests

source: Error toggling user:
fr: Chargement des détails du test...

source: Error deleting user:
fr: Chargement des détails du test...

source: Password:
fr: Audité

source: Auth Method:
fr: Méthode d'authentification :

source: Username Selector:
fr: Tout sélectionner

source: Password Selector:
fr: Tout sélectionner

source: Submit Selector:
fr: Tout sélectionner

source: Login Successful
fr: Connexion réussie

source: - User authenticated successfully
fr: La page a été supprimée avec succès

source: Not used yet
fr: Non synchronisé

source: Back to List
fr: Retour à la page

source: Edit Website
fr: Tester le site web

source: Website Name
fr: Sites web

source: Optional display name
fr: Nom d'affichage optionnel

source: Scraping Configuration
fr: Configuration

source: Max Pages
fr: pages

source: Maximum number of pages to discover (default: unlimited)
fr: Limiter le nombre de pages à découvrir (utile pour les grands sites)

source: Max Depth
fr: profondeur

source: How many clicks away from the starting page (default: 10)
fr: Combien de clics depuis la page de départ (par défaut : 10)

source: Request Delay (seconds)
fr: Délai entre les requêtes (secondes)

source: Delay between requests
fr: Délai entre les requêtes

source: Follow external links
fr: Suivre les liens externes

source: Include subdomains
fr: Inclure les sous-domaines

source: Respect robots.txt
fr: Respecter robots.txt

source: Update Website
fr: Tester le site web

source: Discovery Users
fr: Découvrir les pages

source: Discover Pages
fr: Découvrir les pages

source: Abort
fr: Les deux

source: Select users to test:
fr: Sélectionner les utilisateurs pour la découverte :

source: Test All Pages
fr: Tester tous les sites

source: Discovery History
fr: Découverte démarrée

source: Discovery Issues
fr: Découvrir les pages

source: page(s) could not be discovered:
fr: page(s) n'ont pas pu être découvertes :

source: Show
fr: Afficher

source: more failed pages...
fr: pages échouées supplémentaires...

source: attempts
fr: tentatives

source: Pages Found
fr: pages

source: depth
fr: profondeur

source: Add Page
fr: pages

source: Page navigation
fr: Actions

source: First
fr: Premier

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: Last
fr: Dernier

source: violations
fr: Actions

source: Not tested
fr: Dernier test

source: Leave empty for unlimited discovery
fr: Laisser vide pour aucune limite

source: Limit the number of pages to discover. Default is unlimited (up to 1 million pages).
fr: Limiter le nombre de pages à découvrir (utile pour les grands sites)

source: Discovery will crawl your website starting from the home page, following links to find all accessible pages.
fr: La découverte explorera le site web à partir de la page d'accueil, en suivant les liens pour trouver toutes les pages accessibles.

source: Add Page Manually
fr: Ajouter une page manuellement

source: Page URL
fr: pages

source: Test All Pages Options
fr: Options de test de toutes les pages

source: Start Testing
fr: Tests

source: users
fr: Utilisateurs de test

source: Testing Complete
fr: Vient de se terminer

source: All pages have been tested. Refreshing...
fr: Toutes les pages ont été testées. Actualisation...

source: The discovery process has finished.
fr: Annuler le processus de découverte ?

source: Are you sure you want to abort the discovery process?
fr: Êtes-vous sûr de vouloir supprimer le projet

source: Discovery is already running. Do you want to cancel it?
fr: La découverte est déjà en cours pour ce site web. Voulez-vous l'annuler ?

source: Please select at least one user for discovery using the Discovery Users dropdown.
fr: Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).

source: Starting discovery...
fr: Commencer la découverte

source: Please select at least one test user using the Test Users dropdown.
fr: Veuillez sélectionner au moins un utilisateur de test (ou Invité) pour continuer.Veuillez sélectionner au moins un utilisateur de test (ou Invité) pour continuer.Veuillez sélectionner au moins un utilisateur de test (ou Invité) pour continuer.Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).Veuillez sélectionner au moins un utilisateur pour la découverte (ou Invité).

source: Testing Started
fr: Tests

source: pages for testing
fr: Tests de navigateur

source: Failed to queue tests
fr: Échec de la mise en file d'attente des tests

source: Failed to start testing
fr: Échec du démarrage de la découverte

source: Are you sure you want to cancel the testing process?
fr: Êtes-vous sûr de vouloir supprimer le projet

source: Failed to add page
fr: Échec de la suppression du rapport

source: Test Started
fr: Testées

source: Page queued for testing
fr: Page mise en file d'attente pour les tests

source: Page test has been cancelled
fr: Le test de page a été annulé

source: Are you sure you want to delete this page?
fr: Êtes-vous sûr de vouloir supprimer le projet

source: This will also delete all test results for this page.
fr: Cela supprimera également tous les résultats de test pour cette page.Cela supprimera également tous les résultats de test pour cette page.Cela supprimera également tous les résultats de test pour cette page.Cela supprimera définitivement tous les sites web, pages et résultats de tests associés à ce projet.

source: Page Deleted
fr: Éléments de la page

source: Page has been deleted successfully
fr: La page a été supprimée avec succès

source: Failed to delete page
fr: Échec de la suppression du rapport

source: Discovery Running...
fr: Options de découverte

source: pages. Refreshing...
fr: Actualisation...

source: Discovery Failed
fr: Échec de la découverte :

source: Discovery failed
fr: Échec de la découverte :

source: Currently testing
fr: Tests de navigateur

source: Testing Cancelled
fr: Découverte annulée

source: Testing was cancelled
fr: Découverte annulée

source: Testing Failed
fr: Tests

source: Testing failed
fr: Tests

source: No testing job to cancel
fr: Aucune tâche de découverte à annuler

source: Failed to cancel testing
fr: Échec de l'annulation de la découverte

source: Report Generation
fr: Génération de rapport

source: Generating site structure report in
fr: Génération du rapport de structure de site en

source: Generating accessibility report in
fr: Génération du rapport d'accessibilité en

source: Schedules
fr: Horaires

source: Test Schedules
fr: Horaires de tests

source: Schedule
fr: Horaire

source: Create Schedule
fr: Créer un horaire

source: Edit Schedule
fr: Modifier l'horaire

source: Schedule Name
fr: Nom de l'horaire

source: Schedule automated accessibility tests for %(name)s
fr: Planifier des tests d'accessibilité automatisés pour %(name)s

source: Scheduled Testing:
fr: Tests planifiés :

source: Create schedules to run accessibility tests automatically at specific times or intervals. You can configure which tests run and optionally limit AI testing to specific pages to control costs.
fr: Créez des horaires pour exécuter des tests d'accessibilité automatiquement à des moments ou intervalles spécifiques. Vous pouvez configurer quels tests s'exécutent et optionnellement limiter les tests IA à des pages spécifiques pour contrôler les coûts.

source: AI Testing
fr: Tests IA

source: All Pages
fr: Toutes les pages

source: Next Run
fr: Prochaine exécution

source: Last Run
fr: Dernière exécution

source: Running
fr: En cours

source: Run Now
fr: Exécuter maintenant

source: No schedules yet
fr: Aucun horaire pour l'instant

source: Create Your First Schedule
fr: Créer votre premier horaire

source: Run this schedule now?
fr: Exécuter cet horaire maintenant ?

source: Test run started!
fr: L'exécution du test a démarré !

source: Are you sure you want to delete this schedule? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer cet horaire ? Cette action est irréversible.

source: Optional description of this schedule
fr: Description optionnelle de cet horaire

source: Enable this schedule
fr: Activer cet horaire

source: Schedule Timing
fr: Planification

source: Schedule Type
fr: Type d'horaire

source: One-time
fr: Une fois

source: Daily
fr: Quotidien

source: Weekly
fr: Hebdomadaire

source: Monthly
fr: Mensuel

source: Custom Cron
fr: Cron personnalisé

source: Time
fr: Heure

source: Day of Week
fr: Jour de la semaine

source: Monday
fr: Lundi

source: Tuesday
fr: Mardi

source: Wednesday
fr: Mercredi

source: Thursday
fr: Jeudi

source: Friday
fr: Vendredi

source: Saturday
fr: Samedi

source: Sunday
fr: Dimanche

source: Day of Month
fr: Jour du mois

source: Note: For months with fewer days, test runs on the last day
fr: Note : Pour les mois avec moins de jours, le test s'exécute le dernier jour

source: Cron Expression
fr: Expression Cron

source: Format: minute hour day month weekday (e.g., "0 2 * * *" = daily at 2am)
fr: Format : minute heure jour mois jour_semaine (ex., "0 2 * * *" = tous les jours à 2h)

source: Timezone
fr: Fuseau horaire

source: Enable AI Testing
fr: Activer les tests IA

source: AI Testing Scope
fr: Portée des tests IA

source: Run AI analysis on every page (higher cost)
fr: Exécuter l'analyse IA sur chaque page (coût plus élevé)

source: Selected Pages Only
fr: Pages sélectionnées uniquement

source: Choose specific pages for AI analysis
fr: Choisir des pages spécifiques pour l'analyse IA

source: No AI Testing
fr: Pas de tests IA

source: Run only automated JavaScript tests
fr: Exécuter uniquement les tests JavaScript automatisés
