Repository: bobdodd/auto_a11y_python
Catalog: auto_a11y/web/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Refresh
fr: Actualisation...

source: Sync Issues
fr: Problèmes de synchronisation

source: Error loading content:
fr: Erreur lors du chargement du contenu :

source: No discovered pages found.
fr: Aucune page découverte trouvée.

source: Synced
fr: Synchronisé

source: Failed
fr: Échoué

source: No recordings found.
fr: Nouveau projet

source: Unknown duration
fr: Durée inconnue

source: issues
fr: Problèmes

source: Please select at least one item to upload.
fr: Veuillez sélectionner au moins un élément à téléverser.

source: Edit Page
fr: pages

source: Page Title
fr: Stratégie de chargement de page

source: Enter page title
fr: Entrer le titre de la page

source: URL cannot be changed
fr: L'URL ne peut pas être modifiée

source: Priority
fr: Priorité

source: Critical
fr: Critique

source: High
fr: Élevé

source: Normal
fr: Minimal

source: Low
fr: Faible

source: Notes
fr: Remarque :

source: Add any notes about this page
fr: Ajouter des notes sur cette page

source: Page Information
fr: Configuration

source: Status:
fr: Statut

source: Discovered
fr: Découvrir

source: Error
fr: Erreur

source: Discovered:
fr: Découvrir

source: Unknown
fr: Inconnu

source: Last Tested:
fr: Dernier test

source: Violations:
fr: Actions

source: Warnings:
fr: avertissements

source: Configure Test Matrix
fr: Configuration

source: Scripts
fr: Aucune description

source: Test Matrix
fr: Date du test

source: Back to Scripts
fr: Retour à la page

source: No Testable Scripts
fr: Descriptions détaillées :

source: Create New Script
fr: Nouveau projet

source: About Test Combinations
fr: Configuration

source: Before
fr: Avant

source: After
fr: Date

source: All Combinations
fr: Actions

source: Clear All
fr: Tout sélectionner

source: Add Combination
fr: Documents

source: Test Combinations
fr: Configuration

source: combinations
fr: Documents

source: Script Execution Order
fr: Déclencheur d'exécution

source: Tests: Before & After
fr: Avant et après

source: Tests: Before only
fr: Teste avant le script uniquement

source: Tests: After only
fr: Teste après le script uniquement

source: Move up
fr: Résolu

source: Save Matrix Configuration
fr: Enregistrer la configuration

source: None
fr: Remarque :

source: Script executed
fr: Tout activer

source: Save Configuration
fr: Enregistrer la configuration

source: Untitled Page
fr: Page sans titre

source: Cancel Test
fr: Annuler

source: Test as guest (no login)
fr: Tester en tant qu'invité (sans connexion)

source: Run Test
fr: Exécuter le test

source: Test in Progress
fr: Tests

source: The page will automatically refresh when testing completes.
fr: La page se rafraîchira automatiquement lorsque le test sera terminé.

source: Queued
fr: En file d'attente

source: Last Tested
fr: Dernier test

source: Test Duration
fr: Détails du test

source: N/A
fr: N/D

source: Page Screenshot
fr: Éléments de la page

source: Screenshot of
fr: Prendre des captures d'écran des problèmes

source: No screenshot available
fr: Aucune capture d'écran disponible

source: Automated Accessibility Score
fr: Plateforme de tests d'accessibilité automatisés

source: Get help about accessibility score
fr: Obtenir de l'aide sur le score d'accessibilité

source: automated checks passed
fr: Tests automatisés

source: Automated WCAG Compliance Score
fr: Conformité WCAG

source: Get help about compliance score
fr: Obtenir de l'aide sur le score de conformité

source: automated tests passed
fr: Tests automatisés

source: No data available
fr: Aucun projet disponible

source: Accessibility Issues Found
fr: Problèmes d'accessibilité trouvés

source: types found
fr: Trouvé

source: Accessibility Checks Performance
fr: Plateforme de tests d'accessibilité automatisés

source: Overall Pass Rate
fr: Taux de réussite global

source: Get help about overall pass rate
fr: Obtenir de l'aide sur le taux de réussite global

source: passed
fr: Audité

source: failed
fr: Échoué

source: Passed
fr: Audité

source: tests
fr: Tester

source: Total Tested
fr: Dernier test

source: Understanding the Numbers
fr: Comprendre les chiffres

source: Test Check Details
fr: Détails du test

source: Test
fr: Tester

source: Check
fr: Vérification

source: WCAG
fr: WCAG AA

source: Pass Rate
fr: Taux de réussite

source: Accessibility checks for %(touchpoint)s
fr: Vérifications d'accessibilité pour %(touchpoint)s

source: Totals
fr: Totaux

source: N/A checks
fr: vérifications N/A

source: skipped
fr: ignorées

source: Latest Test Results
fr: Dernier test

source: Tested on
fr: Testées

source: Page States Tested
fr: Dernier test

source: This page was tested in multiple states. Select a state below to view its test results.
fr: Cette page a été testée dans plusieurs états. Sélectionnez un état ci-dessous pour voir ses résultats de test.

source: Page states
fr: Stratégie de chargement de page

source: Initial page state (before script execution)
fr: État initial de la page (avant l'exécution du script)

source: After executing script:
fr: Après l'exécution du script :

source: State
fr: État

source: Errors:
fr: Erreurs :

source: Issues that must be fixed for WCAG compliance
fr: Problèmes à corriger pour la conformité WCAG

source: Breakpoint:
fr: Point d'arrêt :

source: px width
fr: px de largeur

source: Guest
fr: Invité

source: About this issue:
fr: À propos de ce problème :

source: What the issue is:
fr: Quel est le problème :

source: Why this is important:
fr: Pourquoi c'est important :

source: Who it affects:
fr: Qui cela affecte :

source: How to remediate:
fr: Comment y remédier :

source: Relevant test criteria:
fr: Critères de test pertinents :

source: WCAG Success Criteria:
fr: Critères de succès WCAG :

source: Rule:
fr: Règle :

source: Help:
fr: Aide

source: How to fix:
fr: Comment corriger :

source: Touchpoint:
fr: Point de contact :

source: General
fr: Général

source: More about
fr: En savoir plus sur

source: Ways to meet
fr: Façons de respecter

source: Location:
fr: Actions

source: Copy XPath to clipboard
fr: Copier le XPath dans le presse-papiers

source: CSS State:
fr: État CSS :

source: Code Snippet
fr: Extrait de code

source: Interactive element(s) being obscured:
fr: Éléments non-interactifs dans l'ordre de tabulation

source: %(count)d element(s) with text smaller than 16px:
fr: %(count)d élément(s) avec un texte inférieur à 16px :

source: Page Thumbnail (at time of test)
fr: Vignette de la page (au moment du test)

source: Thumbnail of
fr: Vignette de

source: Thumbnail not available
fr: Vignette non disponible

source: Click to view full size
fr: Cliquer pour voir en taille réelle

source: AI Detection Note:
fr: Détection de langue

source: This issue was detected through visual analysis.
fr: Ce problème a été détecté par analyse visuelle.

source: Confidence:
fr: Confiance :

source: Affected Elements
fr: Éléments de la page

source: Text size:
fr: Tester le site web

source: Elements Outside Landmarks
fr: Déplacer la région principale en dehors des autres régions repères

source: Element
fr: éléments

source: Content preview:
fr: En attente

source: Missing Accessibility Attributes
fr: Attributs d'accessibilité manquants

source: Map container
fr: Conteneur de carte

source: containing
fr: contenant

source: is missing required ARIA attributes:
fr: n'a pas les attributs ARIA requis :

source: to identify this as a
fr: pour identifier ceci comme

source: navigable region
fr: une région navigable

source: graphic/image
fr: un graphique/image

source: to describe what the map shows (e.g., "Office locations map")
fr: pour décrire ce que la carte affiche (ex. "Carte des bureaux")

source: Without these attributes, screen readers cannot identify this as a map or describe its purpose to users.
fr: Sans ces attributs, les lecteurs d'écran ne peuvent pas identifier ceci comme une carte ni décrire son utilité aux utilisateurs.

source: Silent Focus Trap Details
fr: Détails du piège de focus silencieux

source: This map container has
fr: Ce conteneur de carte a

source: but contains
fr: mais contient

source: focusable element(s) that keyboard users can still reach:
fr: élément(s) focusable(s) que les utilisateurs au clavier peuvent encore atteindre :

source: button(s)
fr: bouton(s)

source: link(s)
fr: lien(s)

source: form input(s)
fr: champ(s) de formulaire

source: other focusable element(s)
fr: autre(s) élément(s) focusable(s)

source: Screen reader users navigating by keyboard will have focus move to these elements but hear nothing, creating confusion about where they are on the page.
fr: Les utilisateurs de lecteurs d'écran naviguant au clavier verront le focus se déplacer vers ces éléments sans rien entendre, créant de la confusion sur leur position dans la page.

source: Potential issues that should be reviewed
fr: Problèmes potentiels à examiner

source: Additional information and best practice recommendations
fr: Meilleures pratiques et recommandations

source: This is an informational note.
fr: Ceci est une note informative.

source: Discovery Items
fr: Découvrir les pages

source: Elements found that may need manual review
fr: Éléments trouvés nécessitant une révision manuelle

source: About this discovery item:
fr: À propos de cet élément découvert :

source: What was found:
fr: Ce qui a été trouvé :

source: Why manual review is needed:
fr: Pourquoi une révision manuelle est nécessaire :

source: Who could be affected:
fr: Qui pourrait être affecté :

source: What to check manually:
fr: Ce qu'il faut vérifier manuellement :

source: This item requires manual inspection.
fr: Cet élément nécessite une inspection manuelle.

source: This item requires manual inspection to ensure accessibility.
fr: Cet élément nécessite une inspection manuelle pour assurer l'accessibilité.

source: View Screenshot
fr: Voir la capture d'écran

source: Test History
fr: Utilisateurs de test

source: User
fr: Audité

source: Duration
fr: Durée

source: View
fr: Voir

source: Screenshot
fr: Capture d'écran

source: Open in New Tab
fr: Ouvrir dans un nouvel onglet

source: Running Test
fr: avertissements

source: Testing...
fr: Test en cours...

source: Running accessibility tests on this page...
fr: Exécution des tests d'accessibilité sur cette page...

source: This may take a moment.
fr: Cela peut prendre un moment.

source: Screenshot:
fr: Capture d'écran :

source: Test Complete
fr: Vient de se terminer

source: Refreshing page to show results...
fr: Actualisation de la page pour afficher les résultats...

source: Test Cancelled
fr: Découverte annulée

source: The page test has been cancelled.
fr: Le test de page a été annulé.

source: Failed to cancel test
fr: Échec de l'annulation de la découverte

source: Failed to cancel test:
fr: Échec de l'annulation de la découverte :

source: Unknown error
fr: Erreur inconnue

source: Test started
fr: Testées

source: The accessibility test is running. The page will refresh when complete.
fr: Le test d'accessibilité est en cours. La page se rafraîchira une fois terminé.Le test d'accessibilité est en cours. La page se rafraîchira une fois terminé.Le test d'accessibilité est en cours. La page se rafraîchira une fois terminé.Le test d'accessibilité est en cours. La page se rafraîchira une fois terminé.

source: Test failed:
fr: Testées

source: Failed to start test
fr: Échec du démarrage de la découverte

source: Starting Test...
fr: Démarrage...

source: Cancelling...
fr: Annulation...

source: No WCAG criteria found
fr: Aucun critère WCAG trouvé

source: No touchpoints found
fr: Aucun point de contact trouvé

source: All Touchpoints
fr: Tous les points de contact

source: All WCAG Criteria
fr: Tous les critères WCAG

source: Filter Test Results
fr: Filtrer les résultats des tests

source: Active Filters:
fr: Filtres actifs :

source: Showing:
fr: Affichage :

source: items
fr: éléments

source: Issue Type
fr: Type de problème

source: Impact Level
fr: Niveau d'impact

source: Medium
fr: Modifier

source: WCAG Criteria
fr: Critères WCAG :

source: Touchpoint
fr: Point de contact

source: Affected User Groups
fr: Groupes d'utilisateurs affectés

source: Hearing
fr: Audition

source: Motor
fr: Motricité

source: Cognitive
fr: Cognitif

source: Seizure
fr: Épilepsie

source: Test User
fr: Utilisateurs de test

source: Quick Search
fr: Recherche rapide

source: Search in issue descriptions, IDs, or code...
fr: Rechercher dans les descriptions, ID ou code...

source: Add Test Supervisor
fr: Utilisateurs de test

source: Testing Participants
fr: Participants

source: Add Supervisor
fr: Utilisateurs de test

source: Supervisor Information
fr: Configuration

source: Name
fr: Nom

source: e.g., Dr. Sarah Johnson
fr: par ex., Dr. Sarah Dubois

source: Full name of the test supervisor
fr: Utilisateurs de test

source: e.g., sarah.johnson@example.com
fr: par ex., sarah.dubois@exemple.fr

source: Contact email for the supervisor (optional)
fr: Email de contact du superviseur (optionnel)

source: e.g., Accessibility Specialist, Research Lead
fr: par ex., Spécialiste en accessibilité, Responsable de recherche

source: Accessibility Specialist
fr: Plateforme de tests d'accessibilité automatisés

source: Research Lead
fr: Responsable de recherche

source: UX Researcher
fr: Chercheur UX

source: Accessibility Consultant
fr: Plateforme de tests d'accessibilité automatisés

source: Project Manager
fr: Projets

source: Quality Assurance Lead
fr: Responsable assurance qualité

source: Job title or role (optional)
fr: Titre du poste ou rôle (optionnel)

source: Organization
fr: Actions

source: e.g., Accessibility Research Institute
fr: Plateforme de tests d'accessibilité automatisés

source: Organization or company name (optional)
fr: Nom de l'organisation ou de l'entreprise (optionnel)

source: Additional information about this supervisor...
fr: Informations supplémentaires sur ce superviseur...

source: Optional notes (e.g., areas of expertise, contact preferences)
fr: Notes optionnelles (par ex., domaines d'expertise, préférences de contact)

source: About Test Supervisors
fr: Utilisateurs de test

source: Common Supervisor Roles
fr: Tout sélectionner

source: Supervisor Responsibilities
fr: Responsabilités du superviseur

source: Test supervisors typically:
fr: Utilisateurs de test

source: Coordinate testing sessions
fr: Coordonner les sessions de test

source: Ensure ethical testing practices
fr: Gérer les utilisateurs de test

source: Provide technical support
fr: Fournir un support technique

source: Document findings
fr: Documents

source: Communicate with stakeholders
fr: Communiquer avec les parties prenantes

source: Add Lived Experience Tester
fr: Voir le site web

source: Add Tester
fr: Ajouter des utilisateurs de test

source: Tester Information
fr: Configuration

source: e.g., Jane Smith
fr: p. ex., Jane Dupont

source: Full name of the lived experience tester
fr: Nom complet du testeur d'expérience vécue

source: e.g., jane.smith@example.com
fr: par ex., jane.dupont@exemple.fr

source: Contact email for the tester (optional)
fr: Email de contact du testeur (optionnel)

source: Disability Type
fr: Tout désactiver

source: e.g., Blind, Low Vision, Deaf, Motor Disability
fr: par ex., Aveugle, Malvoyant, Sourd, Handicap moteur

source: Blind
fr: Aveugle

source: Low Vision
fr: Malvoyant

source: Deaf
fr: Sourd

source: Hard of Hearing
fr: Malentendant

source: Motor Disability
fr: Handicap moteur

source: Cognitive Disability
fr: Handicap cognitif

source: Multiple Disabilities
fr: Handicaps multiples

source: Type of disability (optional)
fr: Nom (Optionnel)

source: Assistive Technologies
fr: Technologies d'assistance

source: e.g., JAWS, ZoomText, Dragon NaturallySpeaking
fr: par ex., JAWS, ZoomText, Dragon NaturallySpeaking

source: Comma-separated list of assistive technologies used
fr: Liste des technologies d'assistance utilisées, séparées par des virgules

source: Additional information about this tester...
fr: Informations supplémentaires sur ce testeur...

source: Optional notes (e.g., availability, special requirements)
fr: Notes optionnelles (par ex., disponibilité, exigences particulières)

source: About Lived Experience Testers
fr: Voir le site web

source: Common Disability Types
fr: Types de handicap courants

source: Deaf / Hard of Hearing
fr: Sourd / Malentendant

source: Common Assistive Technologies
fr: Technologies d'assistance courantes

source: Screen Readers:
fr: Capture d'écran :

source: Magnification:
fr: Actions

source: built-in magnifiers
fr: loupes intégrées

source: Voice Control:
fr: Contrôle vocal :

source: Alternative Input:
fr: Saisie alternative :

source: Edit Supervisor
fr: Utilisateurs de test

source: Edit Test Supervisor
fr: Utilisateurs de test

source: Update Supervisor
fr: Utilisateurs de test

source: Edit Tester
fr: Auditeur/Testeur

source: Edit Lived Experience Tester
fr: Voir le site web

source: Update Tester
fr: Tester le site web

source: Manage lived experience testers and test supervisors for %(name)s
fr: Gérer les testeurs d'expérience vécue et superviseurs de test pour %(name)s

source: Testing Participants:
fr: Participants

source: Lived Experience Testers
fr: Voir le site web

source: Not specified
fr: Aucune page spécifiée

source: None specified
fr: Aucune page spécifiée

source: No email
fr: Minimal

source: No lived experience testers yet
fr: Voir le site web

source: Add Your First Tester
fr: Créez votre premier projet

source: Test Supervisors
fr: Utilisateurs de test

source: No test supervisors yet
fr: Utilisateurs de test

source: Add Your First Supervisor
fr: Télécharger un enregistrement

source: Are you sure you want to delete this tester? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le projet

source: Error: %s
fr: Erreur : %s

source: Error deleting tester: %s
fr: Erreur lors de la suppression du testeur : %s

source: Are you sure you want to delete this supervisor? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le projet

source: Error deleting supervisor: %s
fr: Erreur lors de la suppression du superviseur : %s

source: Create Test User
fr: Ajouter des utilisateurs de test

source: Test Users
fr: Utilisateurs de test

source: Create
fr: Créé :

source: User Information
fr: Configuration

source: e.g., Student User, John Doe
fr: par ex., Utilisateur étudiant, John Doe

source: Friendly name for this test user (optional)
fr: Nom convivial pour cet utilisateur de test (optionnel)

source: Username
fr: Audité

source: e.g., student123
fr: par ex., étudiant123

source: Username for login
fr: sans connexion

source: Password for login (stored securely)
fr: Mot de passe pour la connexion (stocké en toute sécurité)

source: Roles
fr: Projets

source: e.g., student, premium, member
fr: par ex., étudiant, premium, membre

source: Comma-separated list of user roles for testing role-based content
fr: Liste de rôles d'utilisateur séparés par des virgules pour tester le contenu basé sur les rôlesListe de rôles d'utilisateur séparés par des virgules pour tester le contenu basé sur les rôles

source: Notes about this user...
fr: Ajouter des notes sur cette page

source: Optional notes about this test user
fr: Ajouter des notes sur cette page

source: User is active and can be used for testing
fr: L'utilisateur est actif et peut être utilisé pour les tests

source: Login Configuration
fr: Configuration

source: Authentication Method
fr: Méthode d'authentification

source: Login Page URL
fr: pages

source: Full URL of the login page
fr: URL complète de la page de connexion

source: Username Field Selector
fr: Sélecteur du champ nom d'utilisateur

source: CSS selector for username input
fr: Sélecteur CSS pour l'entrée du nom d'utilisateur

source: Password Field Selector
fr: Sélecteur conditionnel

source: CSS selector for password input
fr: Sélecteur CSS pour l'entrée du mot de passe

source: Submit Button Selector
fr: Tout sélectionner

source: CSS selector for login button
fr: Sélecteur CSS pour le bouton de connexion

source: Success Indicator Selector
fr: Sélecteur conditionnel

source: CSS selector that appears after successful login
fr: Sélecteur CSS qui apparaît après une connexion réussie

source: Logout Configuration
fr: Configuration

source: Logout URL
fr: URL de déconnexion

source: URL to visit for logout (optional if using button)
fr: URL à visiter pour la déconnexion (optionnel si utilisation d'un bouton)

source: Logout Button Selector
fr: Tout sélectionner

source: CSS selector for logout button/link (optional)
fr: Sélecteur CSS pour le bouton/lien de déconnexion (optionnel)

source: Logout Success Indicator Selector
fr: Sélecteur d'indicateur de succès de déconnexion

source: Session Timeout (minutes)
fr: Délai d'attente (ms)

source: How long the session stays valid
fr: Durée de validité de la session

source: User Roles
fr: Utilisateurs de test

source: Student account
fr: Testées

source: Teacher/instructor
fr: Enseignant/instructeur

source: Administrator
fr: Audité

source: Paid member
fr: Membre payant

source: Free tier user
fr: Utilisateur niveau gratuit

source: CSS Selectors
fr: Tout sélectionner

source: Use browser DevTools to find selectors:
fr: Utiliser les DevTools du navigateur pour trouver les sélecteurs :

source: Right-click the element
fr: Éléments de la page

source: Select "Inspect"
fr: Supprimer le projet

source: Right-click in the HTML panel
fr: Clic droit dans le panneau HTML

source: Copy → Copy selector
fr: Tout sélectionner

source: Common Patterns
fr: Composants communs

source: By ID:
fr: Par ID :

source: By name:
fr: Nom

source: By type:
fr: Type

source: By class:
fr: Par classe :

source: Edit Test User
fr: Ajouter des utilisateurs de test

source: Leave blank to keep current password
fr: Laisser vide pour conserver le mot de passe actuel

source: Only enter a password if you want to change it
fr: Entrez un mot de passe uniquement si vous souhaitez le modifier

source: Usage History
fr: Utilisateurs de test

source: Last Used:
fr: Dernier test

source: Last Login Status:
fr: État de la synchronisation

source: Success
fr: Succès

source: Not attempted yet
fr: Pas encore tenté

source: Last Error:
fr: Erreurs :

source: Roles help you test content that varies based on user permissions.
fr: Les rôles vous aident à tester le contenu qui varie en fonction des autorisations utilisateur.Les rôles vous aident à tester le contenu qui varie en fonction des autorisations utilisateur.

source: Password Update
fr: Taux de réussite

source: Leave the password field blank to keep the current password unchanged.
fr: Laissez le champ mot de passe vide pour conserver le mot de passe actuel inchangé.Laissez le champ mot de passe vide pour conserver le mot de passe actuel inchangé.

source: breadcrumb
fr: fil d'ariane

source: Manage authenticated test users for %(name)s
fr: Gérer les utilisateurs de test authentifiés pour %(name)s

source: Project-Level Test Users:
fr: Utilisateurs de test au niveau du projet :

source: Auth Method
fr: Méthode d'auth.

source: Last Used
fr: Dernier test

source: No roles
fr: Notes informatives

source: Login Failed
fr: Tests

source: Login OK
fr: sans connexion

source: Disable
fr: Tout désactiver

source: Enable
fr: Tout activer

source: User Roles in Use
fr: Rôles d'utilisateur utilisés

source: No test users yet
fr: Utilisateurs de test

source: Create Your First Test User
fr: Créez votre premier projet

source: Error:
fr: Erreurs :

source: Error toggling user:
fr: Chargement des détails du test...

source: Are you sure you want to delete this test user? This action cannot be undone.
fr: Êtes-vous sûr de vouloir supprimer le projet

source: Error deleting user:
fr: Chargement des détails du test...

source: Display Name:
fr: Nom d'affichage optionnel

source: Username:
fr: Audité

source: Roles:
fr: Règle :
