Repository: bobdodd/auto_a11y_python
Catalog: auto_a11y/web/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Select Pages for AI Testing
fr: Sélectionner les pages pour les tests IA

source: pages available
fr: pages disponibles

source: Test Settings
fr: Paramètres de test

source: Run JavaScript Tests
fr: Exécuter les tests JavaScript

source: Run Python Tests
fr: Exécuter les tests Python

source: Take Screenshots
fr: Prendre des captures d'écran

source: Select which users to test with. Leave unchecked to test as guest only.
fr: Sélectionnez les utilisateurs avec lesquels tester. Laissez décoché pour tester en tant qu'invité uniquement.

source: Schedule Details
fr: Détails de l'horaire

source: Total Runs
fr: Exécutions totales

source: Upcoming Runs
fr: Prochaines exécutions

source: No upcoming runs scheduled
fr: Aucune exécution prochaine planifiée

source: Last Execution
fr: Dernière exécution

source: Run Time
fr: Heure d'exécution

source: Job ID
fr: ID de tâche

source: This schedule has not run yet
fr: Cet horaire n'a pas encore été exécuté

source: JavaScript Tests
fr: Tests JavaScript

source: Python Tests
fr: Tests Python

source: Screenshots
fr: Captures d'écran

source: Selected Pages
fr: Pages sélectionnées

source: AI testing is disabled for this schedule
fr: Les tests IA sont désactivés pour cet horaire

source: Testing as guest (no login)
fr: Test en tant qu'invité (sans connexion)

source: Scheduler Status
fr: État du planificateur

source: Registered
fr: Enregistré

source: Not Registered
fr: Non enregistré

source: Scheduler Not Running
fr: Planificateur non actif

source: Danger Zone
fr: Zone de danger

source: Delete this schedule
fr: Supprimer cet horaire

source: Once deleted, this schedule cannot be recovered.
fr: Une fois supprimé, cet horaire ne peut pas être récupéré.

source: Delete Schedule
fr: Supprimer l'horaire

source: Cancelled
fr: Annulé

source: e.g., Nightly Full Scan
fr: ex., Analyse complète nocturne

source: Schedule deleted
fr: Horaire supprimé

source: Schedule enabled
fr: Horaire activé

source: Schedule disabled
fr: Horaire désactivé

source: Error starting test run:
fr: Erreur lors du démarrage du test :

source: Error toggling schedule:
fr: Erreur lors de l'activation/désactivation de l'horaire :

source: Once at
fr: Une fois le

source: no date set
fr: aucune date définie

source: Not set
fr: Non défini

source: Daily at
fr: Tous les jours à

source: Weekly on
fr: Chaque semaine le

source: at
fr: à

source: Monthly on day
fr: Chaque mois le jour
