Repository: bobdodd/auto_a11y_python
Catalog: auto_a11y/web/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: Please log in to access this page.
fr: Veuillez vous connecter pour accéder à cette page.

source: You do not have permission to access this page.
fr: Vous n'avez pas la permission d'accéder à cette page.

source: Administrator access required.
fr: Accès administrateur requis.

source: Auditor access required.
fr: Accès auditeur requis.

source: Please enter both email and password.
fr: Veuillez entrer le courriel et le mot de passe.

source: Invalid email or password.
fr: Courriel ou mot de passe invalide.

source: Account is temporarily locked. Please try again later.
fr: Compte temporairement verrouillé. Veuillez réessayer plus tard.

source: Your account has been deactivated. Please contact an administrator.
fr: Votre compte a été désactivé. Veuillez contacter un administrateur.

source: You have been logged out.
fr: Vous avez été déconnecté.

source: Email is required.
fr: Le courriel est requis.

source: Please enter a valid email address.
fr: Veuillez entrer une adresse courriel valide.

source: Password is required.
fr: Le mot de passe est requis.

source: Password must be at least 8 characters.
fr: Le mot de passe doit contenir au moins 8 caractères.

source: Passwords do not match.
fr: Les mots de passe ne correspondent pas.

source: An account with this email already exists.
fr: Un compte avec ce courriel existe déjà.

source: Admin account created successfully. Please log in.
fr: Compte administrateur créé avec succès. Veuillez vous connecter.

source: Account created successfully. Please log in.
fr: Compte créé avec succès. Veuillez vous connecter.

source: Profile updated successfully.
fr: Profil mis à jour avec succès.

source: Current password is incorrect.
fr: Le mot de passe actuel est incorrect.

source: New password must be at least 8 characters.
fr: Le nouveau mot de passe doit contenir au moins 8 caractères.

source: New passwords do not match.
fr: Les nouveaux mots de passe ne correspondent pas.

source: Password changed successfully.
fr: Mot de passe changé avec succès.

source: Invalid role selected.
fr: Rôle invalide sélectionné.

source: User created successfully.
fr: Utilisateur créé avec succès.

source: User not found.
fr: Utilisateur non trouvé.

source: User updated successfully.
fr: Utilisateur mis à jour avec succès.

source: Password reset successfully.
fr: Mot de passe réinitialisé avec succès.

source: Account unlocked.
fr: Compte déverrouillé.

source: You cannot delete your own account.
fr: Vous ne pouvez pas supprimer votre propre compte.

source: User deleted successfully.
fr: Utilisateur supprimé avec succès.

source: why_it_matters
fr: Qui cela affecte :

source: who_it_affects
fr: Qui cela affecte :

source: how_to_fix
fr: Comment corriger :

source: Page not found
fr: Page non trouvée

source: Test matrix updated successfully
fr: La page a été supprimée avec succès

source: Test matrix created successfully
fr: La page a été supprimée avec succès

source: Failed to save test matrix: %(error)s
fr: Échec de l'annulation de la découverte :

source: No Recordings Available
fr: Aucun enregistrement disponible

source: There are no recordings for this project yet. Once recordings have been added, you can generate a report.
fr: Il n'y a pas encore d'enregistrements pour ce projet. Une fois les enregistrements ajoutés, vous pourrez générer un rapport.

source: No recordings found for this project
fr: Aucun enregistrement trouvé pour ce projet

source: Page Not Found
fr: Page non trouvée

source: The page you're looking for doesn't exist.
fr: La page que vous recherchez n'existe pas.

source: Go Home
fr: Accueil

source: Server Error
fr: Erreurs :

source: Internal Server Error
fr: Erreur interne du serveur

source: Something went wrong on our end.
fr: Quelque chose s'est mal passé de notre côté.

source: About - Auto A11y
fr: Auto A11y

source: About Auto A11y
fr: Auto A11y

source: Auto A11y is an automated web accessibility testing tool designed to help developers and testers identify and fix accessibility issues in web applications.
fr: Auto A11y est un outil de test d'accessibilité Web automatisé conçu pour aider les développeurs et testeurs à identifier et corriger les problèmes d'accessibilité dans les applications Web.

source: Features
fr: Fonctionnalités

source: Automated WCAG 2.2 compliance testing
fr: Conformité WCAG

source: Lived experience testing with real users
fr: Voir le site web

source: Manual accessibility audits and recordings
fr: Plateforme de tests d'accessibilité automatisés

source: Comprehensive reporting and issue tracking
fr: Rapports complets et suivi des problèmes

source: Project and test user management
fr: Gestion de projet et d'utilisateurs de test

source: WCAG Data Attribution
fr: Attribution des données WCAG

source: This application uses official WCAG (Web Content Accessibility Guidelines) data from the World Wide Web Consortium (W3C).
fr: Cette application utilise les données officielles WCAG (Règles pour l'accessibilité des contenus Web) du World Wide Web Consortium (W3C).

source: The WCAG Success Criteria data used in this application is sourced from:
fr: Les données des critères de succès WCAG utilisées dans cette application proviennent de :

source: Web Content Accessibility Guidelines (WCAG) 2.2
fr: Règles pour l'accessibilité des contenus Web (WCAG) 2.2

source: Techniques for WCAG 2.2
fr: Techniques pour WCAG 2.2

source: WCAG 2.2 JSON Data
fr: Données WCAG 2.2 JSON

source: Important Notice
fr: Avis important

source: The WCAG content is used with attribution as permitted by W3C. The content has not been modified. All additional content, analysis, and features provided by Auto A11y are clearly distinguished from the original W3C WCAG content.
fr: Le contenu WCAG est utilisé avec attribution comme le permet le W3C. Le contenu n'a pas été modifié. Tout contenu, analyse et fonctionnalité supplémentaire fourni par Auto A11y est clairement distingué du contenu WCAG original du W3C.

source: Copyright
fr: Droits d'auteur

source: W3C Document License
fr: Licence de document W3C

source: applies to the WCAG content.
fr: s'applique au contenu WCAG.

source: Additional Resources
fr: Ressources supplémentaires

source: W3C Web Accessibility Initiative (WAI)
fr: Initiative pour l'accessibilité du Web du W3C (WAI)

source: W3C Web Accessibility Initiative
fr: Initiative pour l'accessibilité du Web du W3C

source: How to Meet WCAG (Quick Reference)
fr: Voir la référence rapide WCAG

source: Understanding WCAG 2.2
fr: Comprendre WCAG 2.2

source: Evaluating Web Accessibility Overview
fr: Aperçu de l'évaluation de l'accessibilité Web

source: Quick Info
fr: Aide rapide

source: Version Information
fr: Configuration

source: WCAG Version:
fr: Malvoyant

source: Last Updated:
fr: Date

source: October 2023
fr: Octobre 2023

source: Conformance Levels
fr: Conformité WCAG

source: Auto A11y tests against all three WCAG conformance levels:
fr: Auto A11y teste les trois niveaux de conformité WCAG :

source: Level A:
fr: Niveau AA :

source: Minimum level of conformance
fr: Niveau minimum de conformité

source: Level AA:
fr: Niveau AA :

source: Standard level (most common target)
fr: Niveau standard (objectif le plus courant)

source: Level AAA:
fr: Niveau AAA :

source: Highest level of conformance
fr: Niveau de conformité le plus élevé

source: Testing Approaches
fr: Tests

source: Auto A11y supports multiple testing approaches:
fr: Auto A11y prend en charge plusieurs approches de test :

source: Automated Testing:
fr: Tests automatisés

source: Using axe-core engine
fr: Utilisant le moteur axe-core

source: Manual Audits:
fr: Télécharger un enregistrement

source: Human expert evaluation
fr: Évaluation par un expert humain

source: Lived Experience:
fr: Expérience vécue - Application

source: Testing by people with disabilities
fr: Handicaps multiples

source: View Help
fr: Détails du test

source: Dashboard
fr: Tableau de bord

source: Projects
fr: Projets

source: Testing
fr: Tests

source: Recordings
fr: Enregistrements

source: Reports
fr: Rapports

source: Help
fr: Aide

source: Settings
fr: Paramètres

source: Fixture Status
fr: État des fixtures

source: Admin
fr: Administrateur

source: Auditor
fr: Auditeur

source: Profile
fr: Profil

source: User Management
fr: Gestion des utilisateurs

source: Logout
fr: Déconnexion

source: Login
fr: Connexion

source: Canadian National Institute for the Blind
fr: Institut national canadien pour les aveugles

source: Mobile navigation
fr: Actions

source: Total Pages
fr: Total des pages

source: Tested Pages
fr: Page d\'index avec toutes les pages testées

source: Total Issues
fr: Total des problèmes

source: Errors
fr: Erreurs

source: Warnings
fr: Problèmes de noms accessibles (formulaires, liens, boutons)

source: Info Notes
fr: Notes d'information

source: Discovery
fr: Découverte

source: Quick Actions
fr: Actions rapides

source: New Project
fr: Nouveau projet

source: Run Tests
fr: Exécuter les tests

source: Generate Report
fr: Générer un rapport

source: Test Coverage
fr: Couverture des tests

source: Tested
fr: Testées

source: of
fr: sur

source: pages tested
fr: pages testées

source: System Status
fr: État du système

source: Database
fr: Base de données

source: Connected
fr: Connecté

source: Browser Engine
fr: Moteur de navigateur

source: Ready
fr: Prêt

source: AI Analysis
fr: Analyse IA

source: Enabled
fr: Activé

source: Disabled
fr: Désactivé

source: Help & Documentation - Auto A11y
fr: Aide et documentation - Auto A11y

source: Documentation
fr: Documents

source: Understanding Scores
fr: Comprendre les chiffres

source: WCAG Standards
fr: Standard

source: Impact Levels
fr: Niveau AA :

source: Testing Process
fr: Tests

source: Reports & Exports
fr: Rapports et exports

source: Help & Documentation
fr: Aide et documentation

source: Understanding Your Scores
fr: Comprendre les chiffres

source: Automated vs Manual Testing Scores
fr: Gérer les utilisateurs de test

source: Auto A11y provides two types of scores based on your testing approach:
fr: Auto A11y fournit deux types de scores en fonction de votre approche de test :

source: Automated Testing Scores
fr: Tests automatisés

source: (from automated scans) and
fr: Tests automatisés

source: Manual Testing Scores
fr: Gérer les utilisateurs de test

source: (from expert audits and lived experience testing).
fr: Voir le site web

source: Fast, consistent, repeatable
fr: Rapide, cohérent, reproductible

source: Checks code-level issues
fr: Découvrir les pages

source: Can catch 30-40%% of accessibility issues
fr: Peut détecter 30-40%% des problèmes d'accessibilité

source: Available for tested pages
fr: Disponible pour les pages testées

source: Generated from human expert audits and lived experience testing with real users.
fr: Généré à partir d'audits d'experts humains et de tests d'expérience vécue avec de vrais utilisateurs.

source: Subjective, context-aware testing
fr: Tests subjectifs, sensibles au contexte

source: Tests user experience and workflows
fr: Teste l'expérience utilisateur et les flux de travail

source: Catches issues automation misses
fr: Détecte les problèmes que l'automatisation manque

source: Available for manual recordings
fr: Télécharger un enregistrement

source: Why Do I Have Two Different Scores?
fr: Pourquoi ai-je deux scores différents ?

source: Within each testing type (automated or manual), you'll see two scores:
fr: Au sein de chaque type de test (automatisé ou manuel), vous verrez deux scores :

source: 📊 Accessibility Score
fr: Plateforme de tests d'accessibilité automatisés

source: Measures the percentage of individual checks/issues that passed
fr: Mesure le pourcentage de vérifications/problèmes individuels réussis

source: Shows progress toward compliance
fr: Montre la progression vers la conformité

source: Counts partial successes
fr: Compte les succès partiels

source: Good for tracking improvements
fr: Bon pour suivre les améliorations

source: ✅ WCAG Compliance Score
fr: Conformité WCAG

source: Measures the percentage of WCAG Success Criteria passed
fr: Mesure le pourcentage de critères de succès WCAG réussis

source: Shows true WCAG conformance
fr: Montre la véritable conformité WCAG

source: Based on applicable Success Criteria
fr: Critères applicables

source: Used for legal compliance
fr: Conformité WCAG

source: Real Example:
fr: Exemple :

source: Test Results:
fr: Tester le site web

source: 10 form fields tested
fr: Créez votre premier projet

source: 9 have proper labels ✓
fr: 9 ont des étiquettes correctes ✓

source: 1 missing label ✗
fr: 1 étiquette manquante ✗

source: Accessibility Score:
fr: Plateforme de tests d'accessibilité automatisés

source: 90%% (9/10 passed)
fr: 90%% (9/10 réussis)

source: Good progress!
fr: Tests

source: Compliance Score:
fr: Conformité WCAG

source: 0%% (test has violations)
fr: Options de test de toutes les pages

source: Not compliant
fr: Conformité WCAG

source: Accessibility Score Formula
fr: Plateforme de tests d'accessibilité automatisés

source: (Passed Checks / Applicable Checks) × 100
fr: (Vérifications réussies / Vérifications applicables) × 100

source: Excellent - Minor issues only
fr: Excellent - Problèmes mineurs uniquement

source: Good - Some barriers remain
fr: Bon - Quelques obstacles subsistent

source: Fair - Significant issues
fr: Passable - Problèmes significatifs

source: Below 50%%:
fr: Moins de 50%% :

source: Poor - Major accessibility problems
fr: Médiocre - Problèmes d'accessibilité majeurs

source: Compliance Score Formula
fr: Conformité WCAG

source: (Tests with Zero Violations / Total Tests) × 100
fr: (Tests sans violations / Total des tests) × 100

source: Fully compliant
fr: Conformité WCAG

source: Nearly compliant
fr: Conformité WCAG

source: Below 90%%:
fr: Moins de 90%% :

source: Level A
fr: Niveau A

source: Minimum
fr: Minimal

source: Basic features
fr: Fonctionnalités de base

source: Essential for any site
fr: Essentiel pour tout site

source: Alt text, page titles
fr: Entrer le titre de la page

source: Level AA
fr: Niveau AA :

source: Recommended
fr: Niveau AA (Recommandé)

source: Legal standard
fr: Standard

source: Removes major barriers
fr: Élimine les obstacles majeurs

source: 4.5:1 contrast ratio
fr: Ratio de contraste 4.5:1

source: Level AAA
fr: Niveau AAA

source: Enhanced
fr: Tout activer

source: Highest level
fr: Sites web

source: Not always required
fr: Non audité

source: 7:1 contrast ratio
fr: Ratio de contraste 7:1

source: Issue Impact Levels
fr: Niveaux d'impact des problèmes

source: 🔴 High Impact
fr: Impact :

source: Completely blocks access for some users
fr: Bloque complètement l'accès pour certains utilisateurs

source: Missing alt text on images
fr: Texte alternatif manquant sur les images

source: No keyboard navigation
fr: Actions

source: Missing form labels
fr: Étiquettes de formulaire manquantes

source: Action:
fr: Actions

source: Fix immediately
fr: Corriger immédiatement

source: 🟡 Medium Impact
fr: Impact :

source: Significantly degrades experience
fr: Dégrade significativement l'expérience

source: Poor color contrast
fr: Mauvais contraste de couleur

source: Missing landmarks
fr: Points de repère manquants

source: Unclear link text
fr: Texte de lien peu clair

source: Fix soon
fr: Corriger rapidement

source: 🟢 Low Impact
fr: Impact :

source: Minor inconvenience
fr: Inconvénient mineur

source: Redundant alt text
fr: Texte alternatif redondant

source: Decorative issues
fr: Découvrir les pages

source: Minor labeling issues
fr: pages

source: Fix when convenient
fr: Corriger quand c'est pratique

source: ℹ️ Info/Discovery
fr: Découvrir

source: Best practices and recommendations
fr: Meilleures pratiques et recommandations

source: Optimization opportunities
fr: Opportunités d'optimisation

source: Manual review items
fr: Pourquoi une révision manuelle est nécessaire :

source: Not counted in scoring
fr: Aucun problème trouvé dans cet enregistrement.

source: Review for improvements
fr: Voir les projets

source: Test Applicability
fr: Disponibilité des tests :

source: Tests are marked "Not Applicable" when there are no relevant elements on the page.
fr: Les tests sont marqués comme "Non applicable" lorsqu'il n'y a pas d'éléments pertinents sur la page.

source: Example:
fr: Exemple :

source: If a page has no images, the images test will be marked as not applicable and won't affect your score.
fr: Si une page n'a pas d'images, le test d'images sera marqué comme non applicable et n'affectera pas votre score.

source: Benefits:
fr: Avantages :

source: More accurate scoring
fr: Notation plus précise

source: No penalties for missing elements
fr: Aucune pénalité pour les éléments manquants

source: Focus on actual issues
fr: Se concentrer sur les problèmes réels

source: Pass Tracking
fr: Taux de réussite

source: Our tests track both failures and successes to provide comprehensive feedback.
fr: Nos tests suivent à la fois les échecs et les réussites pour fournir des retours complets.

source: Test Component
fr: Vient de se terminer

source: What It Tracks
fr: Qui cela affecte :

source: Elements Found
fr: éléments

source: Total elements that could be tested
fr: Total des éléments testables

source: Elements Passed
fr: éléments

source: Elements meeting accessibility standards
fr: Génération du rapport d'accessibilité en

source: Elements Failed
fr: éléments

source: Elements with violations
fr: Éléments avec violations

source: Checks Performed
fr: Plateforme de tests d'accessibilité automatisés

source: Individual accessibility criteria tested
fr: Plateforme de tests d'accessibilité automatisés

source: Frequently Asked Questions
fr: Foire aux questions

source: Why is my compliance score so much lower than my accessibility score?
fr: Pourquoi mon score de conformité est-il beaucoup plus bas que mon score d'accessibilité ?

source: The compliance score requires perfect passes (zero violations) for each test, while the accessibility score gives credit for partial passes. Even if 90%% of your checks pass, a single violation makes that test non-compliant.
fr: Le score de conformité exige des réussites parfaites (zéro violation) pour chaque test, tandis que le score d'accessibilité accorde du crédit pour les réussites partielles. Même si 90%% de vos vérifications réussissent, une seule violation rend ce test non conforme.

source: What WCAG level should I aim for?
fr: Quel niveau WCAG dois-je viser ?

source: How often should I run accessibility tests?
fr: À quelle fréquence dois-je effectuer des tests d'accessibilité ?

source: What's the difference between automated and manual testing?
fr: Quelle est la différence entre les tests automatisés et manuels ?

source: Home
fr: Accueil

source: Automated Accessibility Testing Platform
fr: Plateforme de tests d'accessibilité automatisés

source: Comprehensive web accessibility testing combining browser automation, AI-powered analysis, and detailed reporting.
fr: Tests d'accessibilité web complets combinant l'automatisation de navigateur, l'analyse IA et des rapports détaillés.

source: View Projects
fr: Voir les projets

source: AI-Powered Analysis
fr: Analyse par IA

source: Claude AI detects complex accessibility issues that require visual understanding
fr: Claude IA détecte les problèmes d'accessibilité complexes nécessitant une compréhension visuelle

source: Browser Testing
fr: Tests de navigateur

source: Real browser testing with Puppeteer ensures accurate DOM-based results
fr: Les tests avec un navigateur réel via Puppeteer garantissent des résultats précis basés sur le DOMLes tests avec un navigateur réel via Puppeteer garantissent des résultats précis basés sur le DOMLes tests avec un navigateur réel via Puppeteer garantissent des résultats précis basés sur le DOMLes tests avec un navigateur réel via Puppeteer garantissent des résultats précis basés sur le DOMLes tests de navigateur réels avec Puppeteer garantissent des résultats précis basés sur le DOM

source: WCAG Compliance
fr: Conformité WCAG

source: Comprehensive testing against WCAG 2.1 Level A, AA, and AAA guidelines
fr: Tests complets selon les directives WCAG 2.1 Niveau A, AA et AAA

source: Email
fr: Courriel

source: Password
fr: Mot de passe

source: Remember me
fr: Se souvenir de moi

source: Don't have an account? Register
fr: Pas de compte ? S'inscrire

source: Display Name
fr: Nom d'affichage

source: Role
fr: Rôle

source: Member Since
fr: Membre depuis

source: Save Changes
fr: Enregistrer les modifications

source: Change Password
fr: Changer le mot de passe

source: Current Password
fr: Mot de passe actuel

source: New Password
fr: Nouveau mot de passe

source: Minimum 8 characters.
fr: Minimum 8 caractères.

source: Confirm New Password
fr: Confirmer le nouveau mot de passe

source: Register
fr: S'inscrire

source: This will be the first user account and will have administrator privileges.
fr: Ce sera le premier compte utilisateur et aura les privilèges d'administrateur.

source: Optional. How you want your name displayed.
fr: Optionnel. Comment vous souhaitez que votre nom soit affiché.

source: Confirm Password
fr: Confirmer le mot de passe

source: Create Account
fr: Créer un compte

source: Already have an account? Login
fr: Déjà un compte ? Se connecter

source: Create User
fr: Créer un utilisateur

source: Can view tests and download reports
fr: Peut voir les tests et télécharger les rapports

source: Can create projects and run tests
fr: Peut créer des projets et exécuter des tests

source: Full access including user management
fr: Accès complet incluant la gestion des utilisateurs

source: Cancel
fr: Annuler

source: Edit User
fr: Modifier un utilisateur

source: Active
fr: Actif

source: User Statistics
fr: Statistiques de l'utilisateur

source: Created
fr: Créé

source: Last Login
fr: Dernière connexion

source: Login Count
fr: Nombre de connexions

source: Failed Logins
fr: Connexions échouées

source: Reset Password
fr: Réinitialiser le mot de passe

source: Account Locked
fr: Compte verrouillé

source: This account is locked due to too many failed login attempts.
fr: Ce compte est verrouillé suite à trop de tentatives de connexion échouées.

source: Locked until:
fr: Verrouillé jusqu'à :

source: Unlock Account
fr: Déverrouiller le compte

source: Add User
fr: Ajouter un utilisateur

source: Status
fr: Statut

source: Inactive
fr: Inactif

source: Locked
fr: Verrouillé

source: Are you sure you want to delete this user?
fr: Êtes-vous sûr de vouloir supprimer cet utilisateur ?

source: No users found.
fr: Aucun utilisateur trouvé.

source: Never logged in
fr: sans connexion

source: Edit
fr: Modifier

source: Delete
fr: Supprimer

source: Loading...
fr: Démarrage...

source: Select Content to Upload
fr: Sélectionner le contenu à téléverser

source: Discovered Pages
fr: Pages découvertes

source: Uploading to Access Labs Portal...
fr: Téléversement vers Drupal...

source: Upload Log
fr: Journal de téléversement

source: Upload Complete!
fr: Téléversement terminé !

source: Successfully uploaded
fr: Téléversé avec succès

source: Some items failed:
fr: Certains éléments ont échoué :

source: Close
fr: Fermer

source: Start Upload
fr: Démarrer le téléversement

source: Error loading sync status:
fr: Erreur lors du chargement de l'état de synchronisation :

source: Access Labs Portal Integration Not Configured
fr: Intégration Drupal non configurée

source: Configure portal connection in
fr: Configurez la connexion Drupal dans

source: to enable sync.
fr: pour activer la synchronisation.

source: pending
fr: en attente

source: Last Sync
fr: Dernière synchronisation

source: Never
fr: Jamais

source: Synchronization Page
fr: Page de synchronisation

source: Quick Upload
fr: Téléversement rapide
