Repository: bobdodd/auto_a11y_python
Catalog: auto_a11y/web/translations/*/LC_MESSAGES/messages.po
Languages: fr

source: App Screens / Views
fr: Écrans / Vues de l'application

source: Device Sections
fr: Sections de l'appareil

source: Task Context
fr: Contexte de la tâche

source: Media File
fr: Fichier média

source: Issue Summary
fr: Problèmes

source: High Impact
fr: Impact :

source: Medium Impact
fr: Impact :

source: Low Impact
fr: Impact :

source: Manual Accessibility Score
fr: Plateforme de tests d'accessibilité automatisés

source: Based on manually identified issue severity and impact
fr: Basé sur la gravité et l'impact des problèmes identifiés manuellement

source: Manual WCAG Compliance Score
fr: Conformité WCAG

source: Level AA conformance based on manual testing scope
fr: Conformité niveau AA basée sur la portée des tests manuels

source: View Criteria Details
fr: Détails du test

source: Key Takeaways
fr: Points clés à retenir

source: User Painpoints
fr: Points de douleur de l'utilisateur

source: User Quote:
fr: Citation de l'utilisateur :

source: Timecode
fr: Code temporel

source: Start:
fr: Statut

source: End:
fr: Fin :

source: Duration:
fr: Configuration

source: User Assertions
fr: Déclarations de l'utilisateur

source: Context:
fr: Suivant

source: Accessibility Issues
fr: Problèmes d'accessibilité trouvés

source: timecode(s)
fr: code(s) temporel(s)

source: Timecodes:
fr: Codes temporels :

source: What:
fr: WCAG AA

source: Why:
fr: Pourquoi :

source: Who is affected:
fr: Qui cela affecte :

source: WCAG:
fr: WCAG AA

source: Level
fr: Niveau AA :

source: Open
fr: Ouvert

source: In Progress
fr: Tests

source: Resolved
fr: Résolu

source: Verified
fr: Vérifié

source: No issues found in this recording.
fr: Aucun problème trouvé dans cet enregistrement.

source: Status updated successfully
fr: La page a été supprimée avec succès

source: Failed to update status
fr: Échec de la mise en file d'attente des tests

source: Error updating status
fr: Chargement des détails du test...

source: WCAG Success Criteria Breakdown
fr: Critères de succès WCAG :

source: How Criteria Are Determined
fr: Comment les critères sont déterminés

source: The compliance score is calculated based on WCAG 2.2 Level AA criteria
fr: Le score de conformité est calculé sur la base des critères WCAG 2.2 niveau AALe score de conformité est calculé sur la base des critères WCAG 2.2 niveau AALe score de conformité est calculé sur la base des critères WCAG 2.2 niveau AALe score de conformité est calculé sur la base des critères WCAG 2.2 niveau AA

source: total
fr: Totaux

source: criteria
fr: Critique

source: Testing Scope
fr: Portée des tests

source: Applicable Criteria
fr: Critères applicables

source: Excluded Criteria
fr: Critères de succès WCAG :

source: These
fr: Testées

source: Number
fr: Audité

source: Success Criterion
fr: Critères de succès WCAG :

source: View WCAG Quick Reference
fr: Voir la référence rapide WCAG

source: Error saving recording:
fr: Ajouter un enregistrement

source: No project associated with this recording.
fr: Aucun projet associé à cet enregistrement.

source: No discovered pages found for this project.
fr: Aucune page découverte trouvée pour ce projet.

source: Error loading discovered pages.
fr: Erreur lors du chargement des pages découvertes.

source: Upload Recording
fr: Télécharger l'enregistrement

source: Manual audit recordings from Dictaphone and expert reviews. These complement automated test results with human observations and lived experience findings.
fr: Enregistrements d'audits manuels de Dictaphone et de revues d'experts. Ceux-ci complètent les résultats de tests automatisés avec des observations humaines et des constatations d'expérience vécue.

source: All Projects
fr: Tous les projets

source: All Types
fr: Type

source: Lived Exp. Website
fr: Site Web d'expérience vécue

source: Lived Exp. App
fr: Application d'expérience vécue

source: Lived Exp. Device
fr: Expérience vécue - Application

source: Lived Exp. Nav
fr: Application d'expérience vécue

source: Test Account
fr: Testées

source: View Details
fr: Détails du test

source: Upload your first recording
fr: Télécharger un enregistrement

source: to get started.
fr: pour commencer.

source: Upload Recording - Auto A11y
fr: Télécharger un enregistrement - Auto A11y

source: Upload Manual Audit Recording
fr: Télécharger un enregistrement d'audit manuel

source: Upload a Dictaphone JSON file containing accessibility findings from manual audits or lived experience testing.
fr: Téléchargez un fichier JSON Dictaphone contenant les constatations d'accessibilité provenant d'audits manuels ou de tests d'expérience vécue.

source: Dictaphone JSON Files
fr: Fichier JSON Dictaphone *

source: JSON file with accessibility issues in English.
fr: Problèmes d'accessibilité trouvés

source: French Issues (FR)
fr: Problèmes de synchronisation

source: Recording Content (Optional)
fr: Contenu de l'enregistrement (facultatif)

source: Upload HTML or JSON files for key takeaways, user painpoints, and user assertions. You can upload English and/or French versions.
fr: Téléchargez des fichiers HTML ou JSON pour les points clés, les points douloureux de l'utilisateur et les affirmations de l'utilisateur. Les deux formats sont pris en charge.

source: English Content
fr: Vient de se terminer

source: Key Takeaways (EN)
fr: Points clés à retenir

source: Numbered list of the most important accessibility issues found.
fr: Liste numérotée des problèmes d'accessibilité les plus importants trouvés. Accepte le format HTML ou JSON.

source: User Painpoints (EN)
fr: Points de douleur de l'utilisateur

source: User-focused description of difficulties experienced during testing.
fr: Description centrée sur l'utilisateur des difficultés rencontrées pendant les tests. Accepte le format HTML ou JSON.

source: User Assertions (EN)
fr: Déclarations de l'utilisateur

source: Direct quotes and observations from the tester with timecodes.
fr: Citations directes et observations du testeur avec codes temporels. Accepte le format HTML ou JSON.

source: Key Takeaways (FR)
fr: Points clés à retenir

source: User Painpoints (FR)
fr: Points de douleur de l'utilisateur

source: User Assertions (FR)
fr: Déclarations de l'utilisateur

source: Project *
fr: Projet *

source: Select a project...
fr: Sélectionnez un projet...

source: Which project should this recording be associated with?
fr: À quel projet cet enregistrement devrait-il être associé?

source: Test User Account Used
fr: Compte utilisateur de test utilisé

source: Select a test user...
fr: Sélectionnez un utilisateur de test...

source: Optional: Select the test account used during this audit. Choose a project first to see available test users.
fr: Facultatif : Sélectionnez le compte de test utilisé lors de cet audit. Choisissez d'abord un projet pour voir les utilisateurs de test disponibles.

source: Lived Experience Tester
fr: Testeur d'expérience vécue

source: Select a tester...
fr: Sélectionnez un testeur...

source: Select the lived experience tester who performed this test. Choose a project first to see available testers.
fr: Sélectionnez le testeur d'expérience vécue qui a effectué ce test. Choisissez d'abord un projet pour voir les testeurs disponibles.

source: Select a supervisor...
fr: Sélectionnez un superviseur...

source: Select the supervisor who oversaw this test. Choose a project first to see available supervisors.
fr: Sélectionnez le superviseur qui a supervisé ce test. Choisissez d'abord un projet pour voir les superviseurs disponibles.

source: Recording Title
fr: Titre de l'enregistrement

source: e.g., Main Website Screen Reader Audit
fr: p. ex., Audit du lecteur d'écran du site Web principal

source: Optional: A descriptive title for this recording.
fr: Facultatif : Un titre descriptif pour cet enregistrement.

source: Brief description of what was tested and key findings...
fr: Brève description de ce qui a été testé et des principales constatations...

source: Auditor Name
fr: Nom de l'auditeur

source: Auditor Role
fr: Rôle de l'auditeur

source: e.g., Screen Reader User, Expert Auditor
fr: p. ex., Utilisateur de lecteur d'écran, Auditeur expert

source: Lived Experience Website
fr: Site Web d'expérience vécue

source: Lived Experience App
fr: Application d'expérience vécue

source: Lived Experience Tangible Device
fr: Appareil tangible d'expérience vécue

source: Lived Experience Nav and Wayfinding
fr: Navigation et orientation d'expérience vécue

source: Page URLs Covered
fr: URLs des pages couvertes

source: Optional: Enter one URL per line for specific pages discussed in this recording.
fr: Facultatif : Entrez une URL par ligne pour les pages spécifiques discutées dans cet enregistrement.

source: Optional: Select discovered pages related to this recording. Choose a project first to see available pages.
fr: Sélectionner les pages découvertes liées à cet enregistrement

source: Select a project to see discovered pages.
fr: Sélectionnez un projet pour voir les pages découvertes.

source: Optional: Enter one component name per line (e.g., header, nav, footer, modal, carousel).
fr: Facultatif : Entrez un nom de composant par ligne (p. ex., en-tête, nav, pied de page, modal, carrousel).

source: Optional: For app projects - enter one screen/view name per line.
fr: Facultatif : Pour les projets d'application - entrez un nom d'écran/vue par ligne.

source: Optional: For tangible devices - enter one section name per line.
fr: Facultatif : Pour les appareils tangibles - entrez un nom de section par ligne.

source: Task Description
fr: Description de la tâche

source: Complete checkout process
fr: Terminer le processus de commande

source: Optional: Describe the specific task being performed (e.g., "Complete checkout", "Navigate to settings").
fr: Facultatif : Décrivez la tâche spécifique effectuée (p. ex., « Terminer la commande », « Naviguer vers les paramètres »).

source: Select the content types covered in this recording to determine applicable WCAG criteria for compliance scoring.
fr: Sélectionnez les types de contenu couverts dans cet enregistrement pour déterminer les critères WCAG applicables pour le score de conformité.

source: Forms
fr: Formulaires

source: Video (prerecorded)
fr: Vidéo (préenregistrée)

source: Live Multimedia
fr: Multimédia en direct

source: Multilingual Content
fr: Contenu multilingue

source: Orientation Changes
fr: Changements d'orientation

source: Zoom / Text Resize
fr: Zoom / Redimensionnement du texte

source: Timeouts / Re-authentication
fr: Délais d'expiration / Réauthentification

source: Motion Actuation
fr: Actionnement par mouvement

source: Drag and Drop
fr: Glisser-déposer

source: Media File Path
fr: Chemin du fichier média

source: Optional: Path or URL to the actual video/audio recording file for reference.
fr: Facultatif : Chemin ou URL vers le fichier d'enregistrement vidéo/audio réel pour référence.

source: About Dictaphone Format
fr: À propos du format Dictaphone

source: Dictaphone generates accessibility findings from audio/video recordings of manual audits. The JSON format includes:
fr: Dictaphone génère des constatations d'accessibilité à partir d'enregistrements audio/vidéo d'audits manuels. Le format JSON comprend :

source: Recording ID:
fr: ID d'enregistrement :

source: Unique identifier
fr: Identifiant unique

source: Issues:
fr: Problèmes :

source: List of accessibility problems found
fr: Liste des problèmes d'accessibilité trouvés

source: Start/end times in the recording
fr: Heures de début/fin dans l'enregistrement

source: Impact Levels:
fr: Niveaux d'impact :

source: High, Medium, Low
fr: Élevé, Moyen, Faible

source: WCAG Criteria:
fr: Critères WCAG :

source: Relevant guidelines
fr: Directives pertinentes

source: Detailed Descriptions:
fr: Descriptions détaillées :

source: What, why, who, and how to fix
fr: Quoi, pourquoi, qui et comment réparer

source: Example JSON Structure
fr: Exemple de structure JSON

source: Optional: Select which test account was used during this audit.
fr: Facultatif : Sélectionnez quel compte de test a été utilisé lors de cet audit.

source: Manage project users
fr: Gérer les utilisateurs du projet

source: No test users configured for this project.
fr: Aucun utilisateur de test configuré pour ce projet.Aucun utilisateur de test configuré. Les tests s'exécuteront en tant qu'invité.Aucun utilisateur de test configuré. Les tests s'exécuteront en tant qu'invité.Aucun utilisateur de test configuré. Les tests s'exécuteront en tant qu'invité.Aucun utilisateur de test configuré. Les tests s'exécuteront en tant qu'invité.

source: Optional: Select the test account used during this audit.
fr: Facultatif : Sélectionnez le compte de test utilisé lors de cet audit. Choisissez d'abord un projet pour voir les utilisateurs de test disponibles.

source: Select the lived experience tester who performed this test.
fr: Voir le site web

source: No lived experience testers configured for this project. Add testers in project settings.
fr: Aucun testeur d'expérience vécue configuré pour ce projet. Ajoutez des testeurs dans les paramètres du projet.

source: Select the supervisor who oversaw this test.
fr: Sélectionnez le superviseur qui a supervisé ce test. Choisissez d'abord un projet pour voir les superviseurs disponibles.

source: No test supervisors configured for this project. Add supervisors in project settings.
fr: Aucun superviseur de test configuré pour ce projet. Ajoutez des superviseurs dans les paramètres du projet.

source: Error loading testers.
fr: Erreur lors du chargement des projets

source: Error loading supervisors.
fr: Erreur lors du chargement des superviseurs.

source: Optional: Select discovered pages related to this recording.
fr: Sélectionner les pages découvertes liées à cet enregistrement

source: Optional: No discovered pages available for this project.
fr: Facultatif : Aucune page découverte disponible pour ce projet.

source: Accessibility Report
fr: Rapport d'accessibilité

source: Comprehensive accessibility testing results
fr: Résultats complets des tests d'accessibilité

source: Discovery Report
fr: Rapport de découverte

source: Discover content requiring manual inspection
fr: Découvrir le contenu nécessitant une inspection manuelle

source: Generate Discovery Report
fr: Générer un rapport de découverte

source: Site Structure
fr: Structure du site

source: Hierarchical view of website organization
fr: Vue hiérarchique de l'organisation du site web

source: Generate Structure
fr: Générer la structure

source: Offline Report (Static HTML)
fr: Rapport hors ligne (HTML statique)

source: Multi-page offline report with filters, scores, and full issue details (ZIP download)
fr: Rapport hors ligne multi-pages avec filtres, scores et détails complets des problèmes (téléchargement ZIP)

source: Generate Offline Report
fr: Générer un rapport hors ligne

source: Deduplicated Offline Report
fr: Rapport hors ligne dédupliqué

source: Single-page offline report with issues grouped by common components (ZIP download)
fr: Rapport hors ligne d'une seule page avec les problèmes regroupés par composants communs (téléchargement ZIP)

source: Generate Deduplicated Report
fr: Générer un rapport dédupliqué

source: Recordings Report
fr: Rapport d'enregistrements

source: Manual accessibility audit findings from recorded testing sessions
fr: Constatations d'audits d'accessibilité manuels issues de sessions de test enregistrées

source: Generate Recordings Report
fr: Générer un rapport d'enregistrements

source: Recent Reports
fr: Rapports récents

source: Report Name
fr: Nom du rapport

source: Generated
fr: Généré

source: Size
fr: Taille

source: Download
fr: Télécharger

source: No reports generated yet. Click "Generate Report" to create your first report.
fr: Aucun rapport généré pour le moment. Cliquez sur "Générer un rapport" pour créer votre premier rapport.

source: Report Type
fr: Type de rapport

source: PDF Report
fr: Rapport PDF

source: Excel Spreadsheet
fr: Feuille de calcul Excel

source: JSON Export
fr: Export JSON

source: HTML Report
fr: Rapports

source: Select a project first...
fr: Sélectionnez d'abord un projet...

source: Date Range
fr: Plage de dates

source: Include in Report
fr: Inclure dans le rapport

source: Accessibility Violations
fr: Violations d'accessibilité

source: AI Analysis Results
fr: Résultats de l'analyse IA

source: Screenshots (increases file size)
fr: Captures d'écran (augmente la taille du fichier)

source: Executive Summary
fr: Résumé exécutif

source: Loading websites...
fr: Chargement des sites Web...

source: All Websites
fr: Tous les sites Web

source: No websites in this project
fr: Aucun site Web dans ce projet

source: Error loading websites
fr: Erreur lors du chargement des sites Web

source: Generating...
fr: Génération en cours...

source: Failed to generate report:
fr: Échec de la génération du rapport :

source: Error generating report:
fr: Erreur lors de la génération du rapport :

source: Are you sure you want to delete this report?
fr: Êtes-vous sûr de vouloir supprimer le projet

source: Failed to delete report
fr: Échec de la suppression du rapport

source: First select a project...
fr: Sélectionnez d'abord un projet...

source: Choose a project...
fr: Choisir un projet...

source: No projects available
fr: Aucun projet disponible

source: Error loading projects
fr: Erreur lors du chargement des projets

source: Choose a website...
fr: Choisir un projet...

source: Please select a project and website
fr: Veuillez sélectionner un projet et un site web

source: Select a project first
fr: Sélectionnez un projet...

source: All websites in the project will be included
fr: Tester tous les sites web du projet

source: Please select a project
fr: Sélectionnez un projet...

source: Please select a website
fr: Tester tous les sites

source: Generate Site Structure Report
fr: Génération du rapport de structure de site en

source: Select Project
fr: Sélectionner un projet

source: Select the project containing the website
fr: Sélectionnez le projet contenant le site Web

source: Select Website
fr: Sélectionner un site web

source: Select the website to analyze its structure
fr: Sélectionnez le site Web pour analyser sa structure

source: Export Format
fr: Format d'exportation

source: HTML (Interactive)
fr: HTML (Interactif)

source: JSON (Data)
fr: Données WCAG 2.2 JSON

source: CSV (Spreadsheet)
fr: CSV (Feuille de calcul)

source: This report will generate a hierarchical tree view of all pages in the selected website, organized by URL structure.
fr: Ce rapport génèrera une vue arborescente hiérarchique de toutes les pages du site web sélectionné, organisées par structure d'URL.

source: Generate Structure Report
fr: Génération du rapport de structure de site en

source: This report discovers pages with content requiring manual accessibility inspection, including:
fr: Ce rapport découvre les pages avec du contenu nécessitant une inspection manuelle d'accessibilité, notamment :

source: Discovery issues (content requiring human judgment)
fr: Problèmes de découverte (contenu nécessitant un jugement humain)

source: Informational notices
fr: Avis informatifs

source: Accessible name issues (forms, links, buttons)
fr: Problèmes de nom accessible (formulaires, liens, boutons)

source: Elements with poor or missing labels
fr: Éléments avec des étiquettes médiocres ou manquantes

source: Scope
fr: Portée

source: Single Website
fr: Site web unique

source: Entire Project
fr: Projet complet

source: Select the specific website to analyze
fr: Sélectionnez le site web spécifique à analyser

source: HTML (Recommended)
fr: HTML (Recommandé)

source: Generate Offline Report (Static HTML)
fr: Générer un rapport hors ligne (HTML statique)

source: This report generates a complete offline website with:
fr: Ce rapport génère un site web hors ligne complet avec :

source: Index page with all tested pages
fr: Page d'index avec toutes les pages testées

source: Summary page with statistics and charts
fr: Page de résumé avec statistiques et graphiques

source: Individual page detail reports with full issue accordions
fr: Rapports détaillés de pages individuelles avec accordéons complets des problèmes

source: Client-side filters and search
fr: Filtres et recherche côté client

source: All CSS, JS, and images (ZIP download)
fr: Tous les CSS, JS et images (téléchargement ZIP)

source: WCAG Level
fr: Niveau AA :

source: Include Screenshots
fr: Voir la capture d'écran

source: Include Discovery Items
fr: Découvrir les pages

source: Large reports may take several minutes to generate. The report will appear in the list below when complete.
fr: Les rapports volumineux peuvent prendre plusieurs minutes à générer. Le rapport apparaîtra dans la liste ci-dessous une fois terminé.

source: This report generates a single-page offline HTML report with:
fr: Ce rapport génère un rapport HTML hors ligne d'une seule page avec :

source: Issues deduplicated and grouped by common components
fr: Problèmes dédupliqués et regroupés par composants communs

source: Common components table (navigation, headers, footers, forms, etc.)
fr: Tableau des composants communs (navigation, en-têtes, pieds de page, formulaires, etc.)

source: Statistics dashboard with violation, warning, and info counts
fr: Tableau de bord des statistiques avec nombres de violations, d'avertissements et d'informations

source: Client-side filters by component, type, and impact
fr: Filtres côté client par composant, type et impact

source: Test user information for authenticated testing
fr: Tests

source: This report includes manual accessibility findings from:
fr: pour suivre les audits d'accessibilité manuels.

source: Accessibility audit recordings
fr: Plateforme de tests d'accessibilité automatisés

source: Lived experience testing sessions
fr: Voir le site web

source: All issues organized by touchpoint and impact
fr: Tous les problèmes organisés par point de contact et impact

source: Key takeaways and user painpoints
fr: Points de douleur de l'utilisateur

source: WCAG criteria mappings and remediation guidance
fr: Correspondances des critères WCAG et conseils de remédiation

source: All recordings from this project will be included
fr: Tous les enregistrements combinés

source: Timecodes
fr: Codes temporels :

source: Group Issues by Touchpoint
fr: Regrouper les problèmes par point de contact

source: Create Page Setup Script - Auto A11y
fr: Créer un script de configuration de page - Auto A11y

source: Create %(type)s Script
fr: Créer un script %(type)s

source: Create %(level)s Setup Script
fr: Créer un script de configuration %(level)s

source: Website-Level
fr: Sites web

source: Page-Level
fr: Niveau AA :

source: What are Website-Level Scripts?
fr: Que sont les scripts au niveau du site web ?

source: What are Page-Level Scripts?
fr: Que sont les scripts au niveau de la page ?

source: Basic Information
fr: Configuration

source: Script Name
fr: Sites web

source: e.g., Dismiss Cookie Banner
fr: par ex., Fermer la bannière de cookies

source: A descriptive name for this script
fr: Un nom descriptif pour ce script

source: Optional: Describe what this script does
fr: Description optionnelle des objectifs du projet

source: Script Enabled
fr: Tout activer

source: Uncheck to disable this script without deleting it
fr: Décocher pour désactiver ce script sans le supprimer

source: Multi-State Testing
fr: Tests

source: Test BEFORE executing script
fr: Tester AVANT l'exécution du script

source: Test AFTER executing script
fr: Tester APRÈS l'exécution du script
